-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_cumulativeincidence.log
  log type:  text
 opened on:   6 May 2021, 15:56:19

. use analysis/cr_append_process_data, clear

. 
. drop if group==3
(0 observations deleted)

. 
. *Age centring for age-adj KMs
. qui summ age if exposed==1

. gen age_c = age-r(mean)

. 
. 
. *Composite outcome
. sts graph, failure by(group) xtitle(Days from index date) legend(cols(1)) tit
> le("") xtitle(Days from index date) name(composite, replace) plot1opt(lc(blac
> k)) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

. graph export analysis/output/an_cumulativeincidence_composite.svg, as(svg) re
> place
(note: file analysis/output/an_cumulativeincidence_composite.svg not found)
(file analysis/output/an_cumulativeincidence_composite.svg written in SVG forma
> t)

. sts list, at(0 100 183 200) by(group) fail

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
Hospitalised COVID-1 
       0         0        0              0.0000         .          .         .
     100      9907     4915              0.2480    0.0032     0.2418    0.2543
     183      7950     1108              0.3353    0.0038     0.3280    0.3427
     200      7403      145              0.3478    0.0038     0.3403    0.3553
Hospitalised flu 201 
       0         0        0              0.0000         .          .         .
     100     11415     4465              0.2796    0.0036     0.2727    0.2866
     183      9757     1547              0.3778    0.0038     0.3704    0.3854
     200      9507      233              0.3927    0.0039     0.3852    0.4004
General pop 2019 
       0         0        0              0.0000         .          .         .
     100     63549     9876              0.0941    0.0009     0.0923    0.0959
     183     55162     3888              0.1521    0.0012     0.1497    0.1546
     200     51939      723              0.1638    0.0013     0.1612    0.1663
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. *Composite outcome, adjusted for age/sex
. sts graph, failure by(group) xtitle(Days from index date) legend(cols(1)) tit
> le("") xtitle(Days from index date) adjustfor(age_c male) name(composite_ages
> ex, replace) plot1opt(lc(black)) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9
> ) lp(dash_dot))

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

. graph export analysis/output/an_cumulativeincidence_composite_adjagesex.svg, 
> as(svg) replace
(note: file analysis/output/an_cumulativeincidence_composite_adjagesex.svg not 
> found)
(file analysis/output/an_cumulativeincidence_composite_adjagesex.svg written in
>  SVG format)

. 
. *Death outcome
. preserve

.         include analysis/stsetfordeath1ocare.doi

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. cap drop deathexit

. cap drop deathindicator

. cap drop deathfup

. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------

REDACTED - latest is 10th april

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(152,421 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(152,421 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     24,673    200.0443    106.8168        -92        386

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(4,468 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(131,824 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    164,093  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    163,974  observations remaining, representing
      7,439  failures in single-record/single-failure data
   57299935  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       386

. 
.         sts graph, failure by(group) legend(cols(1)) title("") xtitle(Days fr
> om index date) name(death, replace) plot1opt(lc(black)) plot2opt(lc(black) lp
> (dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

.         graph export analysis/output/an_cumulativeincidence_death.svg, as(svg
> ) replace
(note: file analysis/output/an_cumulativeincidence_death.svg not found)
(file analysis/output/an_cumulativeincidence_death.svg written in SVG format)

.         sts list, at(0 100 183 200) by(group) fail

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
Hospitalised COVID-1 
       0         0        0              0.0000         .          .         .
     100     19286     1259              0.0521    0.0014     0.0493    0.0549
     183     12039      350              0.0751    0.0019     0.0716    0.0789
     200     11813       64              0.0801    0.0019     0.0763    0.0840
Hospitalised flu 201 
       0         0        0              0.0000         .          .         .
     100     15397      504              0.0316    0.0014     0.0290    0.0344
     183     15043      279              0.0492    0.0017     0.0459    0.0526
     200     14982       54              0.0526    0.0018     0.0492    0.0562
General pop 2019 
       0         0        0              0.0000         .          .         .
     100    122007      889              0.0072    0.0002     0.0068    0.0077
     183    120903      848              0.0141    0.0003     0.0135    0.0148
     200    120567      157              0.0154    0.0004     0.0147    0.0161
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

.   sts graph, failure by(group) adjustfor(age_c male) legend(cols(1)) title(""
> )  xtitle(Days from index date) name(death_agesex, replace) plot1opt(lc(black
> )) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

.         graph export analysis/output/an_cumulativeincidence_death_adjagesex.s
> vg, as(svg) replace
(note: file analysis/output/an_cumulativeincidence_death_adjagesex.svg not foun
> d)
(file analysis/output/an_cumulativeincidence_death_adjagesex.svg written in SVG
>  format)

. restore

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_cumulativeincidence.log
  log type:  text
 closed on:   6 May 2021, 15:56:42
-------------------------------------------------------------------------------
