-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_cumulativeincidence.log
  log type:  text
 opened on:   2 Apr 2021, 00:45:50

. use analysis/cr_append_process_data, clear

. 
. drop if group==3
(75,514 observations deleted)

. 
. *Age centring for age-adj KMs
. qui summ age if exposed==1

. gen age_c = age-r(mean)

. 
. 
. *Composite outcome
. sts graph, failure by(group) xtitle(Days from index date) legend(cols(1)) tit
> le("") xtitle(Days from index date) name(composite, replace) plot1opt(lc(blac
> k)) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

. graph export analysis/output/an_cumulativeincidence_composite.svg, as(svg) re
> place
(note: file analysis/output/an_cumulativeincidence_composite.svg not found)
(file analysis/output/an_cumulativeincidence_composite.svg written in SVG forma
> t)

. sts list, at(0 100 183 200) by(group) fail

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
Hospitalised COVID-1 
       0         0        0              0.0000         .          .         .
     100      9543     3714              0.2606    0.0037     0.2534    0.2680
     183      4987      965              0.3453    0.0042     0.3372    0.3536
     200      1962       61              0.3564    0.0044     0.3479    0.3650
Hospitalised flu 201 
       0         0        0              0.0000         .          .         .
     100     11483     4514              0.2808    0.0035     0.2739    0.2878
     183      9717     1558              0.3792    0.0038     0.3717    0.3867
     200      9334      228              0.3938    0.0039     0.3863    0.4015
General pop 2019 
       0         0        0              0.0000         .          .         .
     100     60191     7082              0.0964    0.0011     0.0943    0.0985
     183     48274     3617              0.1545    0.0014     0.1518    0.1573
     200     34305      445              0.1647    0.0015     0.1619    0.1676
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. *Composite outcome, adjusted for age/sex
. sts graph, failure by(group) xtitle(Days from index date) legend(cols(1)) tit
> le("") xtitle(Days from index date) adjustfor(age_c male) name(composite_ages
> ex, replace) plot1opt(lc(black)) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9
> ) lp(dash_dot))

         failure _d:  readmission
   analysis time _t:  (exitdate-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

. graph export analysis/output/an_cumulativeincidence_composite_adjagesex.svg, 
> as(svg) replace
(note: file analysis/output/an_cumulativeincidence_composite_adjagesex.svg not 
> found)
(file analysis/output/an_cumulativeincidence_composite_adjagesex.svg written in
>  SVG format)

. 
. *Death outcome
. preserve

.         include analysis/stsetfordeath1ocare.doi

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    27feb2019      01feb2019
 5%    04may2019      01feb2019
10%    03jul2019      01feb2019       Obs               9,410
25%    02dec2019      01feb2019       Sum of Wgt.       9,410

50%    11may2020                      Mean          27apr2020
                        Largest       Std. Dev.      199.5942
75%    17oct2020      12mar2021
90%    10jan2021      12mar2021       Variance       39837.86
95%    02feb2021      12mar2021       Skewness      -.3466591
99%    02mar2021      12mar2021       Kurtosis       2.134723

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(102,169 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(102,169 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     15,901    232.6126    85.41778        -24        357

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(4,282 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(90,418 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    111,625  total observations
        135  observations end on or before enter()
------------------------------------------------------------------------------
    111,490  observations remaining, representing
      5,295  failures in single-record/single-failure data
   36923706  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       357

. 
.         sts graph, failure by(group) legend(cols(1)) title("") xtitle(Days fr
> om index date) name(death, replace) plot1opt(lc(black)) plot2opt(lc(black) lp
> (dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

.         graph export analysis/output/an_cumulativeincidence_death.svg, as(svg
> ) replace
(note: file analysis/output/an_cumulativeincidence_death.svg not found)
(file analysis/output/an_cumulativeincidence_death.svg written in SVG format)

.         sts list, at(0 100 183 200) by(group) fail

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
Hospitalised COVID-1 
       0         0        0              0.0000         .          .         .
     100     14707      873              0.0556    0.0018     0.0521    0.0593
     183     11924      322              0.0790    0.0022     0.0748    0.0835
     200     11679       65              0.0841    0.0023     0.0797    0.0887
Hospitalised flu 201 
       0         0        0              0.0000         .          .         .
     100     15561      503              0.0312    0.0014     0.0286    0.0340
     183     15207      279              0.0486    0.0017     0.0454    0.0520
     200     15146       54              0.0520    0.0018     0.0487    0.0555
General pop 2019 
       0         0        0              0.0000         .          .         .
     100     78611      558              0.0070    0.0003     0.0065    0.0076
     183     77916      483              0.0131    0.0004     0.0124    0.0140
     200     77683      116              0.0146    0.0004     0.0138    0.0155
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

.   sts graph, failure by(group) adjustfor(age_c male) legend(cols(1)) title(""
> )  xtitle(Days from index date) name(death_agesex, replace) plot1opt(lc(black
> )) plot2opt(lc(black) lp(dash)) plot3opt(lc(gs9) lp(dash_dot))

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

.         graph export analysis/output/an_cumulativeincidence_death_adjagesex.s
> vg, as(svg) replace
(note: file analysis/output/an_cumulativeincidence_death_adjagesex.svg not foun
> d)
(file analysis/output/an_cumulativeincidence_death_adjagesex.svg written in SVG
>  format)

. restore

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_cumulativeincidence.log
  log type:  text
 closed on:   2 Apr 2021, 00:46:01
-------------------------------------------------------------------------------
