-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_deathvsflu_interactions.log
  log type:  text
 opened on:   6 May 2021, 16:19:08

. 
. use analysis/cr_append_process_data, clear

. 
. *Death
. *vs 2017_19-flu controls
. include analysis/stsetfordeath1ocare.doi

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. cap drop deathexit

. cap drop deathindicator

. cap drop deathfup

. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------

REDACTED 
latest is 10 April

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(152,421 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(152,421 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     24,673    200.0443    106.8168        -92        386

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(4,468 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(131,824 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    164,093  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    163,974  observations remaining, representing
      7,439  failures in single-record/single-failure data
   57299935  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       386

. 
. keep if group==1|group==2
(123,362 observations deleted)

.         
. *By age
. stcox exposed age1 age2 age3 male i.stp 1.exposed#2.agegroup 1.exposed#3.ageg
> roup 1.exposed#4.agegroup 1.exposed#5.agegroup 1.exposed#6.agegroup

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood =  -36565.08
Iteration 1:   log likelihood = -35615.947
Iteration 2:   log likelihood = -34883.229
Iteration 3:   log likelihood = -34847.271
Iteration 4:   log likelihood = -34847.208
Iteration 5:   log likelihood = -34847.208
Refining estimates:
Iteration 0:   log likelihood = -34847.208

Cox regression -- Breslow method for ties

No. of subjects =       40,642                  Number of obs    =      40,642
No. of failures =        3,535
Time at risk    =     10732237
                                                LR chi2(41)      =     3435.74
Log likelihood  =   -34847.208                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     exposed |   .6677034    .279823    -0.96   0.335     .2936701    1.518125
        age1 |   1.082634   .0128604     6.68   0.000      1.05772    1.108136
        age2 |   .9645686   .0136849    -2.54   0.011     .9381162    .9917669
        age3 |   1.211757   .0745916     3.12   0.002     1.074035    1.367138
        male |   1.178224   .0401972     4.81   0.000     1.102015    1.259702
             |
         stp |
          2  |   1.161853    1.16329     0.15   0.881     .1632665    8.268099
          3  |   1.513655   1.517292     0.41   0.679     .2122169    10.79627
          4  |   1.200484   1.214147     0.18   0.857      .165374    8.714567
          5  |   1.284567   1.311167     0.25   0.806     .1737515    9.496961
          6  |   1.418137    1.42022     0.35   0.727     .1991894    10.09648
          7  |   .8087675   .8418398    -0.20   0.838     .1051513    6.220607
          8  |   1.178734   1.182106     0.16   0.870     .1651121    8.414972
          9  |   1.264592   1.274078     0.23   0.816     .1755352    9.110383
         10  |   1.319594   1.322898     0.28   0.782     .1849726    9.413976
         11  |   1.354083   1.358579     0.30   0.763     .1895038    9.675487
         12  |   .9360093   .9464153    -0.07   0.948     .1290076    6.791175
         13  |    .857281   .8628907    -0.15   0.878     .1192207    6.164455
         14  |   1.252619   1.259879     0.22   0.823     .1744552    8.994024
         15  |    .969059   .9746404    -0.03   0.975     .1349728    6.957517
         16  |   1.135653    1.14026     0.13   0.899     .1587052     8.12644
         17  |   1.195574   1.205438     0.18   0.859     .1657112    8.625829
         18  |   1.309382   1.314574     0.27   0.788     .1830163    9.367922
         19  |   1.130489   1.138754     0.12   0.903      .156979    8.141254
         20  |   1.343122   1.352449     0.29   0.770     .1866391    9.665586
         21  |   .7153564   .7181488    -0.33   0.739     .0999996    5.117368
         22  |   .2814897   .3250631    -1.10   0.272     .0292751    2.706613
         23  |   .9941606   1.001412    -0.01   0.995     .1380531     7.15924
         24  |   1.056786   1.181668     0.05   0.961     .1180858    9.457499
         25  |   1.005481   1.036536     0.01   0.996      .133316    7.583428
         26  |   1.089816   1.094249     0.09   0.932      .152296    7.798617
         27  |   1.211662   1.216703     0.19   0.848     .1692928    8.672106
         28  |   1.257171   1.264095     0.23   0.820     .1751881    9.021614
         29  |   1.129442   1.136755     0.12   0.904     .1570908    8.120394
         30  |   .9297913   .9374917    -0.07   0.942     .1288648    6.708672
         31  |   .5015836   .7093975    -0.49   0.626     .0313672    8.020675
         32  |   1.381584   1.383502     0.32   0.747     .1940862    9.834679
             |
     exposed#|
    agegroup |
Exposed ..) #|
     40-<50  |   1.169634   .5156543     0.36   0.722     .4929268    2.775349
Exposed ..) #|
     50-<60  |   .9412348   .4208779    -0.14   0.892      .391813    2.261086
Exposed ..) #|
     60-<70  |   1.699946   .7763583     1.16   0.245     .6945364    4.160786
Exposed ..) #|
     70-<80  |   2.084546   .9457336     1.62   0.105     .8567056    5.072143
Exposed ..) #|
        80+  |   2.294673   1.041592     1.83   0.067     .9426395    5.585934
------------------------------------------------------------------------------

. 
. lincom exposed, hr

 ( 1)  exposed = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6677034    .279823    -0.96   0.335     .2936701    1.518125
------------------------------------------------------------------------------

. lincom exposed + 1.exposed#2.agegroup, hr       

 ( 1)  exposed + 1.exposed#2bn.agegroup = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7809687   .1609569    -1.20   0.230      .521437    1.169676
------------------------------------------------------------------------------

. lincom exposed + 1.exposed#3.agegroup, hr       

 ( 1)  exposed + 1.exposed#3.agegroup = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .6284657   .0914277    -3.19   0.001     .4725533    .8358192
------------------------------------------------------------------------------

. lincom exposed + 1.exposed#4.agegroup, hr       

 ( 1)  exposed + 1.exposed#4.agegroup = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    1.13506   .1377697     1.04   0.297     .8947523    1.439908
------------------------------------------------------------------------------

. lincom exposed + 1.exposed#5.agegroup, hr       

 ( 1)  exposed + 1.exposed#5.agegroup = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.391859     .13492     3.41   0.001     1.151022    1.683087
------------------------------------------------------------------------------

. lincom exposed + 1.exposed#6.agegroup, hr       

 ( 1)  exposed + 1.exposed#6.agegroup = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.532161   .1396204     4.68   0.000     1.281555    1.831772
------------------------------------------------------------------------------

. 
. *By length stay and days critical care
. stcox i.exposed##i.hosp_lte_1 age1 age2 age3 male i.stp 

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood =  -36565.08
Iteration 1:   log likelihood = -35342.689
Iteration 2:   log likelihood = -34718.947
Iteration 3:   log likelihood = -34706.243
Iteration 4:   log likelihood =  -34706.09
Iteration 5:   log likelihood =  -34706.09
Refining estimates:
Iteration 0:   log likelihood =  -34706.09

Cox regression -- Breslow method for ties

No. of subjects =       40,642                  Number of obs    =      40,642
No. of failures =        3,535
Time at risk    =     10732237
                                                LR chi2(38)      =     3717.98
Log likelihood  =    -34706.09                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     exposed |
Exposed ..)  |   .9021338   .0779062    -1.19   0.233     .7616636     1.06851
1.hosp_lte~k |   .4269465   .0226154   -16.07   0.000     .3848446    .4736545
             |
     exposed#|
hosp_lte_1~k |
Exposed ..) #|
          1  |   1.576757   .1107305     6.48   0.000     1.374003     1.80943
             |
        age1 |   1.113421   .0115582    10.35   0.000     1.090997    1.136307
        age2 |   .9445153   .0122456    -4.40   0.000     .9208168    .9688237
        age3 |   1.265167   .0729081     4.08   0.000     1.130044    1.416446
        male |   1.190344   .0406914     5.10   0.000     1.113204     1.27283
             |
         stp |
          2  |   1.210651   1.212155     0.19   0.849     .1701218    8.615454
          3  |   1.596556   1.600399     0.47   0.641     .2238378    11.38767
          4  |   1.294385   1.309143     0.26   0.799     .1783021    9.396593
          5  |   1.258424   1.284493     0.23   0.822     .1702129    9.303825
          6  |   1.458131   1.460274     0.38   0.706     .2048067    10.38124
          7  |   .8982095   .9349724    -0.10   0.918     .1167716    6.909046
          8  |   1.247251    1.25082     0.22   0.826     .1747097    8.904121
          9  |   1.319046   1.328947     0.27   0.783     .1830918    9.502786
         10  |   1.365112   1.368536     0.31   0.756     .1913517    9.738778
         11  |   1.396283   1.400931     0.33   0.739     .1954061    9.977199
         12  |   .9761554   .9870105    -0.02   0.981     .1345401    7.082492
         13  |   .8939741    .899827    -0.11   0.911     .1243227    6.428348
         14  |   1.255829    1.26311     0.23   0.821     .1749016     9.01711
         15  |   .9842654   .9899337    -0.02   0.987     .1370909    7.066685
         16  |   1.150383   1.155043     0.14   0.889     .1607656    8.231747
         17  |   1.234491   1.244682     0.21   0.834     .1711037    8.906695
         18  |    1.33593   1.341229     0.29   0.773     .1867262    9.557888
         19  |   1.113419   1.121548     0.11   0.915     .1546118    8.018164
         20  |   1.415864   1.425712     0.35   0.730      .196743    10.18928
         21  |    .738074   .7409539    -0.30   0.762     .1031756    5.279864
         22  |    .275601   .3182643    -1.12   0.264     .0286624    2.650021
         23  |   .9881749   .9953784    -0.01   0.991     .1372231    7.116073
         24  |   1.019029   1.139467     0.02   0.987      .113863     9.11991
         25  |   .9400573    .969088    -0.06   0.952     .1246425     7.08994
         26  |   1.123319   1.127899     0.12   0.908      .156975    8.038508
         27  |   1.267584    1.27286     0.24   0.813     .1771059    9.072373
         28  |   1.366929   1.374466     0.31   0.756     .1904809    9.809359
         29  |    1.14708   1.154509     0.14   0.892     .1595436    8.247228
         30  |   .9576142   .9655423    -0.04   0.966     .1327217    6.909382
         31  |   .4676763   .6614345    -0.54   0.591     .0292477    7.478242
         32  |   1.443695   1.445709     0.37   0.714     .2028087    10.27696
------------------------------------------------------------------------------

. test 1.exposed#1.hosp_lte_1w

 ( 1)  1.exposed#1.hosp_lte_1week = 0

           chi2(  1) =   42.05
         Prob > chi2 =    0.0000

. lincom 1.exposed, hr

 ( 1)  1.exposed = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9021338   .0779062    -1.19   0.233     .7616636     1.06851
------------------------------------------------------------------------------

. lincom 1.exposed + 1.exposed#1.hosp_lte_1w, hr

 ( 1)  1.exposed + 1.exposed#1.hosp_lte_1week = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.422446   .1259739     3.98   0.000     1.195782    1.692074
------------------------------------------------------------------------------

. 
. safecount if _d==1 & group==2 & anycrit==1
  0

. stcox exposed age1 age2 age3 male i.stp if anycrit==0

         failure _d:  deathindicator
   analysis time _t:  (deathexit-origin)
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -35915.435
Iteration 1:   log likelihood = -34834.348
Iteration 2:   log likelihood = -34301.157
Iteration 3:   log likelihood = -34288.482
Iteration 4:   log likelihood = -34288.243
Iteration 5:   log likelihood = -34288.243
Refining estimates:
Iteration 0:   log likelihood = -34288.243

Cox regression -- Breslow method for ties

No. of subjects =       37,972                  Number of obs    =      37,972
No. of failures =        3,492
Time at risk    =     10155790
                                                LR chi2(36)      =     3254.38
Log likelihood  =   -34288.243                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     exposed |    1.24502   .0994806     2.74   0.006     1.064543    1.456095
        age1 |   1.115488   .0116404    10.47   0.000     1.092905    1.138537
        age2 |   .9450399    .012237    -4.37   0.000     .9213576    .9693309
        age3 |   1.268392   .0726583     4.15   0.000     1.133688    1.419102
        male |   1.194801   .0409577     5.19   0.000     1.117162    1.277834
             |
         stp |
          2  |   .9932961   .9945342    -0.01   0.995     .1395777    7.068729
          3  |   1.305499   1.308667     0.27   0.790     .1830245    9.312016
          4  |   1.003324   1.015015     0.00   0.997     .1381404     7.28721
          5  |   1.156829   1.181832     0.14   0.887     .1561959     8.56778
          6  |   1.232593   1.234386     0.21   0.835     .1731331    8.775251
          7  |   .7072496   .7361667    -0.33   0.739     .0919535    5.439726
          8  |   1.043015   1.045994     0.04   0.967     .1461024    7.446008
          9  |   1.109561   1.117887     0.10   0.918     .1540148    7.993557
         10  |   1.143108   1.146031     0.13   0.894     .1602171    8.155775
         11  |   1.138661   1.142603     0.13   0.897     .1593112    8.138467
         12  |   .8040494   .8131935    -0.22   0.829     .1107646    5.836663
         13  |   .7330836   .7379414    -0.31   0.758     .1019322    5.272245
         14  |   1.046186   1.052389     0.04   0.964     .1456668    7.513757
         15  |   .8402399   .8451203    -0.17   0.863     .1170193    6.033217
         16  |   .9753916    .979355    -0.02   0.980     .1363072    6.979741
         17  |   1.053392   1.062091     0.05   0.959     .1460022    7.600124
         18  |   1.089337   1.093838     0.09   0.932     .1522103    7.796159
         19  |   .9904183   .9978718    -0.01   0.992      .137471    7.135527
         20  |    1.18459   1.193183     0.17   0.866     .1645097    8.529909
         21  |   .6119024   .6143234    -0.49   0.625     .0855289    4.377755
         22  |   .2394455   .2765134    -1.24   0.216     .0249019    2.302399
         23  |   .8702039   .8766356    -0.14   0.890     .1208171    6.267781
         24  |   .9454612   1.057196    -0.05   0.960     .1056445    8.461371
         25  |   .8699245   .8967762    -0.14   0.892      .115347    6.560802
         26  |   .9339884   .9377561    -0.07   0.946     .1305287    6.683082
         27  |   1.038517   1.042836     0.04   0.970     .1451014    7.432853
         28  |    1.08896   1.094999     0.08   0.932     .1517365    7.815084
         29  |   .9716285   .9779831    -0.03   0.977     .1351238    6.986646
         30  |   .8026646   .8092944    -0.22   0.827     .1112505     5.79117
         31  |   .4259362   .6023995    -0.60   0.546     .0266376    6.810748
         32  |   1.212678   1.214357     0.19   0.847      .170359    8.632284
------------------------------------------------------------------------------

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_deathvsflu_interactions.log
  log type:  text
 closed on:   6 May 2021, 16:19:17
-------------------------------------------------------------------------------
