-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_descriptive.log
  log type:  text
 opened on:   6 May 2021, 15:55:26

. use analysis/cr_append_process_data, clear

. 
. preserve

. keep if group==1|group==4
(16,058 observations deleted)

. bysort setid: gen groupsize = _N

. tab groupsize if group==1

  groupsize |      Freq.     Percent        Cum.
------------+-----------------------------------
         <6 |   REDACTED	<1%
          6 |     24,672      100.00      100.00
------------+-----------------------------------
      Total |     24,673      100.00

. restore

. 
. *How many in both cov and flu groups
. preserve

. keep if group==1|group==2
(123,362 observations deleted)

. sort patient_id

. by patient_id: gen inboth = _N==2

. tab inboth group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |         group
    inboth | Hospitali  Hospitali |     Total
-----------+----------------------+----------
         0 |    24,546     15,931 |    40,477 
           |     99.49      99.21 |     99.38 
-----------+----------------------+----------
         1 |       127        127 |       254 
           |      0.51       0.79 |      0.62 
-----------+----------------------+----------
     Total |    24,673     16,058 |    40,731 
           |    100.00     100.00 |    100.00 

. restore

. 
. 
. 
. 
. histogram entrydate if (group==1|group==2|group==4), by(group, cols(1)) 

. graph export analysis/output/an_descriptive_EVENTSBYTIME.svg, as(svg) replace
(note: file analysis/output/an_descriptive_EVENTSBYTIME.svg not found)
(file analysis/output/an_descriptive_EVENTSBYTIME.svg written in SVG format)

. 
. gen monthyrentry = year(entrydate) * 100 + month(entrydate)

. 
. safetab monthyrent group  if group==2 & entrydate<d(1/11/2019)

monthyrent |   group
        ry | Hospitali |     Total
-----------+-----------+----------
    201701 |       384 |       384 
    201702 |       576 |       576 
    201703 |       296 |       296 
    201704 |        78 |        78 
    201705 |        64 |        64 
    201706 |        23 |        23 
    201707 |        14 |        14 
    201708 |         6 |         6 
    201709 |        19 |        19 
    201710 |        28 |        28 
    201711 |        34 |        34 
    201712 |       247 |       247 
    201801 |     2,029 |     2,029 
    201802 |     2,123 |     2,123 
    201803 |     1,912 |     1,912 
    201804 |       957 |       957 
    201805 |       179 |       179 
    201806 |        39 |        39 
    201807 |        20 |        20 
    201808 |         7 |         7 
    201809 |        17 |        17 
    201810 |        29 |        29 
    201811 |        59 |        59 
    201812 |       229 |       229 
    201901 |     1,645 |     1,645 
    201902 |     2,526 |     2,526 
    201903 |     1,478 |     1,478 
    201904 |       584 |       584 
    201905 |       216 |       216 
    201906 |        66 |        66 
    201907 |        37 |        37 
    201908 |        21 |        21 
    201909 |        33 |        33 
    201910 |        80 |        80 
-----------+-----------+----------
     Total |    16,055 |    16,055 

. 
. safetab readmission group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

readmissio |              group
         n | Hospitali  Hospitali  General p |     Total
-----------+---------------------------------+----------
         0 |    18,167      8,270    106,652 |   133,089 
           |     73.63      51.50      86.45 |     81.11 
-----------+---------------------------------+----------
         1 |       488          0          0 |       488 
           |      1.98       0.00       0.00 |      0.30 
-----------+---------------------------------+----------
         2 |     5,302      7,497     16,212 |    29,011 
           |     21.49      46.69      13.14 |     17.68 
-----------+---------------------------------+----------
         3 |       716        291        498 |     1,505 
           |      2.90       1.81       0.40 |      0.92 
-----------+---------------------------------+----------
     Total |    24,673     16,058    123,362 |   164,093 
           |    100.00     100.00     100.00 |    100.00 

. 
. safetab readm_reason_b group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |              group
   readm_reason_broad | Hospitali  Hospitali  General p |     Total
----------------------+---------------------------------+----------
                 None |    18,167      8,270    106,652 |   133,089 
                      |     74.15      52.29      86.82 |     81.57 
----------------------+---------------------------------+----------
 Other infections (A) |       199        287        320 |       806 
                      |      0.81       1.81       0.26 |      0.49 
----------------------+---------------------------------+----------
          Cancers (C) |       295        591      1,252 |     2,138 
                      |      1.20       3.74       1.02 |      1.31 
----------------------+---------------------------------+----------
Endocrine, nutritiona |       146        148        282 |       576 
                      |      0.60       0.94       0.23 |      0.35 
----------------------+---------------------------------+----------
Mental health and cog |        94         75        160 |       329 
                      |      0.38       0.47       0.13 |      0.20 
----------------------+---------------------------------+----------
Nervous system (G ex  |        98        140        296 |       534 
                      |      0.40       0.89       0.24 |      0.33 
----------------------+---------------------------------+----------
      Circulatory (I) |       629        709      1,530 |     2,868 
                      |      2.57       4.48       1.25 |      1.76 
----------------------+---------------------------------+----------
COVID/Influenza/Pneum |       470        792        745 |     2,007 
                      |      1.92       5.01       0.61 |      1.23 
----------------------+---------------------------------+----------
 Respiratory (J23-99) |       385        740        493 |     1,618 
                      |      1.57       4.68       0.40 |      0.99 
----------------------+---------------------------------+----------
        Digestive (K) |       481        672      2,278 |     3,431 
                      |      1.96       4.25       1.85 |      2.10 
----------------------+---------------------------------+----------
  Musculoskeletal (M) |       259        470      1,396 |     2,125 
                      |      1.06       2.97       1.14 |      1.30 
----------------------+---------------------------------+----------
    Genitourinary (N) |       362        365        916 |     1,643 
                      |      1.48       2.31       0.75 |      1.01 
----------------------+---------------------------------+----------
External causes (S-Y  |       341        379      1,033 |     1,753 
                      |      1.39       2.40       0.84 |      1.07 
----------------------+---------------------------------+----------
                Other |     1,858      1,887      4,988 |     8,733 
                      |      7.58      11.93       4.06 |      5.35 
----------------------+---------------------------------+----------
      Any cause death |       716        291        498 |     1,505 
                      |      2.92       1.84       0.41 |      0.92 
----------------------+---------------------------------+----------
                Total |    24,500     15,816    122,839 |   163,155 
                      |    100.00     100.00     100.00 |    100.00 

. 
. cap file close tablecontent

. file open tablecontent using ./analysis/output/an_descriptive_OUTCOMES.txt, w
> rite text replace
(note: file ./analysis/output/an_descriptive_OUTCOMES.txt not found)

. 
. gen byte cons=1

. 
. foreach outcome of any DENOM composite death{
  2. if "`outcome'"=="death" include analysis/stsetfordeath1ocare.doi
  3. 
. foreach group of numlist 1 2 4 {
  4.         
. if `group'==1 file write tablecontent ("`outcome'") _tab 
  5. 
. if "`outcome'"=="DENOM" local condition 
  6. else local condition " & _d==1"
  7. 
. cou if group==`group' `condition'
  8. file write tablecontent (r(N))
  9. if "`outcome'"=="DENOM" local denominator`group' = r(N)
 10. if "`outcome'"=="DENOM" & `group'==2{
 11.         cou if group==2 & entrydate>=d(1/1/2019)
 12.         file write tablecontent (" (") (r(N)) (" in 2019*)")
 13. }
 14. if "`outcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`de
> nominator`group'') (")")
 15. if `group'<4 file write tablecontent _tab
 16. else file write tablecontent _n
 17. 
. }
 18. 
. if "`outcome'"=="DENOM" file write tablecontent _n 
 19. }
  24,673
  16,058
  6,689
  123,362
  6,499
  7,788
  16,681

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. cap drop deathexit

. cap drop deathindicator

. cap drop deathfup

. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    07mar2019      01feb2019
 5%    23may2019      01feb2019
10%    05aug2019      01feb2019       Obs              11,865
25%    07jan2020      01feb2019       Sum of Wgt.      11,865

50%    09jun2020                      Mean          29may2020
                        Largest       Std. Dev.      200.8664
75%    25nov2020      08apr2021
90%    31jan2021      09apr2021       Variance       40347.29
95%    27feb2021      09apr2021       Skewness      -.4143459
99%    30mar2021      10apr2021       Kurtosis       2.221716

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(152,421 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(152,421 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     24,673    200.0443    106.8168        -92        386

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(4,468 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(131,824 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    164,093  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    163,974  observations remaining, representing
      7,439  failures in single-record/single-failure data
   57299935  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       386

.   2,022
  1,513
  3,904

. 
. drop if group==2 & entrydate<d(1/1/2019)
(9,369 observations deleted)

. 
. include analysis/stsetfordeath1ocare.doi

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. cap drop deathexit

. cap drop deathindicator

. cap drop deathfup

. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------

REDACTED 
latest is 10th april

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(145,363 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(145,363 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     24,673    200.0443    106.8168        -92        386

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(3,127 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(123,624 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        108  observations end on or before enter()
------------------------------------------------------------------------------
    154,616  observations remaining, representing
      6,484  failures in single-record/single-failure data
   53935730  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       386

. 
. preserve 

. qui table died_reason group if _d==1, replace

. table died_reason group if table1>5 [fw=table1]

---------------------------------------------------------------
                                         |        group        
                             died_reason | Hospitalised COVID-1
-----------------------------------------+---------------------
                    Other infections (A) |                   13
                             Cancers (C) |                  359
Endocrine, nutritional and metabolic (E) |                   40
Mental health and cognitive (F, G30, X60 |                  150
               Nervous system (G ex G30) |                  118
                         Circulatory (I) |                  339
COVID/Influenza/Pneumonia/LRTI (J09-22,  |                  560
                    Respiratory (J23-99) |                  156
                           Digestive (K) |                   64
                     Musculoskeletal (M) |                   15
                       Genitourinary (N) |                   28
        External causes (S-Y exc X60-84) |                   15
                                   Other |                   90
---------------------------------------------------------------

---------------------------------------------------------------
                                         |        group        
                             died_reason | Hospitalised flu 201
-----------------------------------------+---------------------
                    Other infections (A) |                     
                             Cancers (C) |                  150
Endocrine, nutritional and metabolic (E) |                   17
Mental health and cognitive (F, G30, X60 |                   35
               Nervous system (G ex G30) |                   32
                         Circulatory (I) |                  112
COVID/Influenza/Pneumonia/LRTI (J09-22,  |                   31
                    Respiratory (J23-99) |                  101
                           Digestive (K) |                   21
                     Musculoskeletal (M) |                    8
                       Genitourinary (N) |                   10
        External causes (S-Y exc X60-84) |                    7
                                   Other |                   22
---------------------------------------------------------------

---------------------------------------------------------------
                                         |        group        
                             died_reason |     General pop 2019
-----------------------------------------+---------------------
                    Other infections (A) |                   20
                             Cancers (C) |                  926
Endocrine, nutritional and metabolic (E) |                   54
Mental health and cognitive (F, G30, X60 |                  377
               Nervous system (G ex G30) |                  256
                         Circulatory (I) |                  891
COVID/Influenza/Pneumonia/LRTI (J09-22,  |                  539
                    Respiratory (J23-99) |                  277
                           Digestive (K) |                  149
                     Musculoskeletal (M) |                   24
                       Genitourinary (N) |                   77
        External causes (S-Y exc X60-84) |                   67
                                   Other |                  194
---------------------------------------------------------------

. restore

. 
. 
. 
. foreach csoutcome of any DENOM otherinfections cancer_ex_nmsc endo_nutr_metab
> ol mentalhealth nervoussystem circulatory respiratorylrti respiratory digesti
> ve musculoskeletal genitourinary external {
  2. 
. foreach group of numlist 1 2 4 {
  3. 
. 
. if "`csoutcome'"=="DENOM" local condition 
  4. else{
  5.         stset CSexit_`csoutcome', fail(CSfail_`csoutcome') origin(entrydat
> e) enter(entrydate) 
  6.         local condition " & _d == 1"
  7.         local conditiondied " & _d == 1 & CSfaildiedonly_`csoutcome' == 1"
  8. 
.         if `group'==1 file write tablecontent ("`csoutcome'") _tab 
  9. }
 10. 
. if "`csoutcome'"!="DENOM" {
 11. cou if group==`group' `conditiondied'
 12. local ndied=r(N)
 13. }
 14. cou if group==`group' `condition'
 15. if "`csoutcome'"!="DENOM" file write tablecontent (r(N)) (" [") (`ndied') 
> ("]")
 16. if "`csoutcome'"=="DENOM" local denominator`group' = r(N)
 17. if "`csoutcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`
> denominator`group'') (")")
 18. if `group'<4 file write tablecontent _tab
 19. else file write tablecontent _n
 20. }
 21. 
. if "`csoutcome'"=="DENOM" file write tablecontent _n 
 22. 
. }
  24,673
  6,689
  123,362

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         92  observations end on or before enter()
------------------------------------------------------------------------------
    154,632  observations remaining, representing
      1,215  failures in single-record/single-failure data
   25644878  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  <=5
  391

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         92  observations end on or before enter()
------------------------------------------------------------------------------
    154,632  observations remaining, representing
      1,215  failures in single-record/single-failure data
   25644878  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  <=5
  255

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         92  observations end on or before enter()
------------------------------------------------------------------------------
    154,632  observations remaining, representing
      1,215  failures in single-record/single-failure data
   25644878  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  6
  569

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
    154,670  observations remaining, representing
      2,399  failures in single-record/single-failure data
   25541144  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  174
  566

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
    154,670  observations remaining, representing
      2,399  failures in single-record/single-failure data
   25541144  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  60
  355

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         54  observations end on or before enter()
------------------------------------------------------------------------------
    154,670  observations remaining, representing
      2,399  failures in single-record/single-failure data
   25541144  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  242
  1,478

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         73  observations end on or before enter()
------------------------------------------------------------------------------
    154,651  observations remaining, representing
        677  failures in single-record/single-failure data
   25703551  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  29
  218

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         73  observations end on or before enter()
------------------------------------------------------------------------------
    154,651  observations remaining, representing
        677  failures in single-record/single-failure data
   25703551  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  13
  98

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         73  observations end on or before enter()
------------------------------------------------------------------------------
    154,651  observations remaining, representing
        677  failures in single-record/single-failure data
   25703551  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  28
  361

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
        672  failures in single-record/single-failure data
 25730784.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  111
  248

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
        672  failures in single-record/single-failure data
 25730784.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  26
  68

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
        672  failures in single-record/single-failure data
 25730784.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  149
  356

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         60  observations end on or before enter()
------------------------------------------------------------------------------
    154,664  observations remaining, representing
        823  failures in single-record/single-failure data
   25697975  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  84
  240

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         60  observations end on or before enter()
------------------------------------------------------------------------------
    154,664  observations remaining, representing
        823  failures in single-record/single-failure data
   25697975  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  21
  116

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         60  observations end on or before enter()
------------------------------------------------------------------------------
    154,664  observations remaining, representing
        823  failures in single-record/single-failure data
   25697975  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  98
  467

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
    154,524  observations remaining, representing
      3,806  failures in single-record/single-failure data
 25390003.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  180
  1,039

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
    154,524  observations remaining, representing
      3,806  failures in single-record/single-failure data
 25390003.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  56
  511

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        200  observations end on or before enter()
------------------------------------------------------------------------------
    154,524  observations remaining, representing
      3,806  failures in single-record/single-failure data
 25390003.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  300
  2,256

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
      1,502  observations end on or before enter()
------------------------------------------------------------------------------
    153,222  observations remaining, representing
      3,156  failures in single-record/single-failure data
 25300450.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  368
  1,490

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
      1,502  observations end on or before enter()
------------------------------------------------------------------------------
    153,222  observations remaining, representing
      3,156  failures in single-record/single-failure data
 25300450.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  18
  497

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
      1,502  observations end on or before enter()
------------------------------------------------------------------------------
    153,222  observations remaining, representing
      3,156  failures in single-record/single-failure data
 25300450.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  55
  1,169

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        176  observations end on or before enter()
------------------------------------------------------------------------------
    154,548  observations remaining, representing
      2,008  failures in single-record/single-failure data
 25544577.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  98
  670

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        176  observations end on or before enter()
------------------------------------------------------------------------------
    154,548  observations remaining, representing
      2,008  failures in single-record/single-failure data
 25544577.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  40
  526

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        176  observations end on or before enter()
------------------------------------------------------------------------------
    154,548  observations remaining, representing
      2,008  failures in single-record/single-failure data
 25544577.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  100
  812

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         98  observations end on or before enter()
------------------------------------------------------------------------------
    154,626  observations remaining, representing
      3,912  failures in single-record/single-failure data
 25308481.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  36
  751

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         98  observations end on or before enter()
------------------------------------------------------------------------------
    154,626  observations remaining, representing
      3,912  failures in single-record/single-failure data
 25308481.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  11
  433

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         98  observations end on or before enter()
------------------------------------------------------------------------------
    154,626  observations remaining, representing
      3,912  failures in single-record/single-failure data
 25308481.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  26
  2,728

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
      2,369  failures in single-record/single-failure data
 25482287.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  9
  408

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
      2,369  failures in single-record/single-failure data
 25482287.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  7
  292

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         69  observations end on or before enter()
------------------------------------------------------------------------------
    154,655  observations remaining, representing
      2,369  failures in single-record/single-failure data
 25482287.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  14
  1,669

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    154,605  observations remaining, representing
      2,152  failures in single-record/single-failure data
 25521590.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  18
  573

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    154,605  observations remaining, representing
      2,152  failures in single-record/single-failure data
 25521590.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  <=5
  287

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
        119  observations end on or before enter()
------------------------------------------------------------------------------
    154,605  observations remaining, representing
      2,152  failures in single-record/single-failure data
 25521590.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  28
  1,292

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         97  observations end on or before enter()
------------------------------------------------------------------------------
    154,627  observations remaining, representing
      2,343  failures in single-record/single-failure data
   25508797  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  <=5
  566

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         97  observations end on or before enter()
------------------------------------------------------------------------------
    154,627  observations remaining, representing
      2,343  failures in single-record/single-failure data
   25508797  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  <=5
  301

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
         97  observations end on or before enter()
------------------------------------------------------------------------------
    154,627  observations remaining, representing
      2,343  failures in single-record/single-failure data
   25508797  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333
  16
  1,476

. 
. file close tablecontent

. 
. **Additional descriptive on the resp/lrti outcome
. stset CSexit_respiratorylrti, fail(CSfail_respiratorylrti) origin(entrydate) 
> enter(entrydate)

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    154,724  total observations
      1,502  observations end on or before enter()
------------------------------------------------------------------------------
    153,222  observations remaining, representing
      3,156  failures in single-record/single-failure data
 25300450.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       333

. *Deaths
. safecount if _d==1 & CSfaildiedonly_respiratorylrti==1 & group==1
  368

. local denomdied = r(N)

. safecount if _d==1 & CSfaildiedonly_respiratorylrti==1 & group==1 & (died_cau
> se_ons=="U071"|died_cause_ons=="U072")
  342

. di "% covid = " 100*r(N)/`denomdied'
% covid = 92.934783

. *Hospitalisations
. safecount if _d==1 & CSfaildiedonly_respiratorylrti!=1 & group==1
  1,122

. local denomhosp = r(N)

. safecount if _d==1 & CSfaildiedonly_respiratorylrti!=1 & group==1 & (admitted
> _respiratorylrti_reason=="U071"|admitted_respiratorylrti_reason=="U072")
  515

. di "% covid = " 100*r(N)/`denomhosp'
% covid = 45.900178

. safecount if _d==1 & CSfaildiedonly_respiratorylrti!=1 & group==1 & (substr(a
> dmitted_respiratorylrti_reason,1,3)=="J18")
  461

. di "% pneumonia = " 100*r(N)/`denomhosp'
% pneumonia = 41.087344

. 
. 
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_descriptive.log
  log type:  text
 closed on:   6 May 2021, 15:56:12
-------------------------------------------------------------------------------
