------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/output/an_descriptive.log
  log type:  text
 opened on:   1 Apr 2021, 17:15:17

. use analysis/cr_append_process_data, clear

. 
. preserve

. keep if group==1|group==4
(91,736 observations deleted)

. bysort setid: gen groupsize = _N

. tab groupsize if group==1

  groupsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |REDACTED
          6 |REDACTED 	     >99      100.00
------------+-----------------------------------
      Total |     15,901      100.00

. restore

. 
. 
. histogram entrydate if (group==1|group==2|group==4), by(group, cols(1)) 

. graph export analysis/output/an_descriptive_EVENTSBYTIME.svg, as(svg) replace
(file analysis/output/an_descriptive_EVENTSBYTIME.svg written in SVG format)

. 
. gen monthyrentry = year(entrydate) * 100 + month(entrydate)

. 
. safetab monthyrent group  if group==2 & entrydate<d(1/11/2019)

monthyrent |   group
        ry | Hospitali |     Total
-----------+-----------+----------
    201701 |       387 |       387 
    201702 |       584 |       584 
    201703 |       302 |       302 
    201704 |        80 |        80 
    201705 |        65 |        65 
    201706 |        23 |        23 
    201707 |        14 |        14 
    201708 |         6 |         6 
    201709 |        19 |        19 
    201710 |        28 |        28 
    201711 |        34 |        34 
    201712 |       248 |       248 
    201801 |     2,056 |     2,056 
    201802 |     2,145 |     2,145 
    201803 |     1,928 |     1,928 
    201804 |       975 |       975 
    201805 |       181 |       181 
    201806 |        39 |        39 
    201807 |        20 |        20 
    201808 |         7 |         7 
    201809 |        17 |        17 
    201810 |        29 |        29 
    201811 |        59 |        59 
    201812 |       231 |       231 
    201901 |     1,648 |     1,648 
    201902 |     2,550 |     2,550 
    201903 |     1,496 |     1,496 
    201904 |       590 |       590 
    201905 |       219 |       219 
    201906 |        67 |        67 
    201907 |        37 |        37 
    201908 |        21 |        21 
    201909 |        34 |        34 
    201910 |        80 |        80 
-----------+-----------+----------
     Total |    16,219 |    16,219 

. 
. safetab readmission group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

readmissio |                    group
         n | Hospitali  Hospitali  Hospitali  General p |     Total
-----------+--------------------------------------------+----------
         0 |    11,055      9,044     39,137     67,885 |   127,121 
           |     69.52      55.75      51.83      85.39 |     67.93 
-----------+--------------------------------------------+----------
         1 |       325          0          0          0 |       325 
           |      2.04       0.00       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         2 |     3,921      6,900     32,388     11,241 |    54,450 
           |     24.66      42.53      42.89      14.14 |     29.10 
-----------+--------------------------------------------+----------
         3 |       600        278      3,989        376 |     5,243 
           |      3.77       1.71       5.28       0.47 |      2.80 
-----------+--------------------------------------------+----------
     Total |    15,901     16,222     75,514     79,502 |   187,139 
           |    100.00     100.00     100.00     100.00 |    100.00 

. 
. safetab readm_reason_b group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |                    group
   readm_reason_broad | Hospitali  Hospitali  Hospitali  General p |     Total
----------------------+--------------------------------------------+----------
                 None |    11,055      9,044     39,137     67,885 |   127,121 
                      |     70.12      56.51      52.34      85.75 |     68.45 
----------------------+--------------------------------------------+----------
 Other infections (A) |       163        262      1,568        211 |     2,204 
                      |      1.03       1.64       2.10       0.27 |      1.19 
----------------------+--------------------------------------------+----------
          Cancers (C) |       211        560      2,677        877 |     4,325 
                      |      1.34       3.50       3.58       1.11 |      2.33 
----------------------+--------------------------------------------+----------
Endocrine, nutritiona |       108        136        718        187 |     1,149 
                      |      0.69       0.85       0.96       0.24 |      0.62 
----------------------+--------------------------------------------+----------
Mental and behavioura |        70         63        415        122 |       670 
                      |      0.44       0.39       0.55       0.15 |      0.36 
----------------------+--------------------------------------------+----------
   Nervous system (G) |        89        137        434        193 |       853 
                      |      0.56       0.86       0.58       0.24 |      0.46 
----------------------+--------------------------------------------+----------
      Circulatory (I) |       438        670      3,627      1,106 |     5,841 
                      |      2.78       4.19       4.85       1.40 |      3.15 
----------------------+--------------------------------------------+----------
COVID/Influenza/Pneum |       356        719      4,561        402 |     6,038 
                      |      2.26       4.49       6.10       0.51 |      3.25 
----------------------+--------------------------------------------+----------
 Respiratory (J23-99) |       290        676      3,588        349 |     4,903 
                      |      1.84       4.22       4.80       0.44 |      2.64 
----------------------+--------------------------------------------+----------
        Digestive (K) |       337        619      2,605      1,541 |     5,102 
                      |      2.14       3.87       3.48       1.95 |      2.75 
----------------------+--------------------------------------------+----------
  Musculoskeletal (M) |       197        423      1,263      1,071 |     2,954 
                      |      1.25       2.64       1.69       1.35 |      1.59 
----------------------+--------------------------------------------+----------
    Genitourinary (N) |       274        334      1,917        636 |     3,161 
                      |      1.74       2.09       2.56       0.80 |      1.70 
----------------------+--------------------------------------------+----------
External causes (S-Y  |       268        349      1,987        756 |     3,360 
                      |      1.70       2.18       2.66       0.95 |      1.81 
----------------------+--------------------------------------------+----------
                Other |     1,309      1,735      6,290      3,452 |    12,786 
                      |      8.30      10.84       8.41       4.36 |      6.88 
----------------------+--------------------------------------------+----------
      Any cause death |       600        278      3,989        376 |     5,243 
                      |      3.81       1.74       5.33       0.47 |      2.82 
----------------------+--------------------------------------------+----------
                Total |    15,765     16,005     74,776     79,164 |   185,710 
                      |    100.00     100.00     100.00     100.00 |    100.00 

. 
. cap file close tablecontent

. file open tablecontent using ./analysis/output/an_descriptive_OUTCOMES.txt, write text replace

. 
. gen byte cons=1

. 
. foreach outcome of any DENOM composite death{
  2. if "`outcome'"=="death" include analysis/setfordeath.doi
  3. 
. foreach group of numlist 1 2 4 {
  4.         
. if `group'==1 file write tablecontent ("`outcome'") _tab 
  5. 
. if "`outcome'"=="DENOM" local condition 
  6. else local condition " & _d==1"
  7. 
. cou if group==`group' `condition'
  8. file write tablecontent (r(N))
  9. if "`outcome'"=="DENOM" local denominator`group' = r(N)
 10. if "`outcome'"=="DENOM" & `group'==2{
 11.         cou if group==2 & entrydate>=d(1/1/2019)
 12.         file write tablecontent (" (") (r(N)) (" in 2019*)")
 13. }
 14. if "`outcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`denominator`group'') (")")
 15. if `group'<4 file write tablecontent _tab
 16. else file write tablecontent _n
 17. 
. }
 18. 
. if "`outcome'"=="DENOM" file write tablecontent _n 
 19. }
  15,901
  16,222
  6,745
  79,502
  4,846
  7,178
  11,617

. 
. *Code chunk for looking at death outcome
. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    17mar2019      01feb2019
 5%    03may2019      01feb2019
10%    12jun2019      01feb2019       Obs              37,000
25%    19sep2019      01feb2019       Sum of Wgt.      37,000

50%    08feb2020                      Mean          26feb2020
                        Largest       Std. Dev.      199.3367
75%    05aug2020      12mar2021
90%    21dec2020      12mar2021       Variance       39735.13
95%    24jan2021      12mar2021       Skewness       .1845416
99%    26feb2021      14mar2021       Kurtosis       1.955246

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_ons if died_date_ons<deathcensor
(151,050 missing values generated)

. gen deathindicator = died_date_ons<deathcensor

. replace deathexit = deathcensor if deathexit==.
(151,050 real changes made)

. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     15,901    238.0728     82.6246          0        359

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(11,082 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexposed')
(147,884 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    187,139  total observations
        244  observations end on or before enter()
------------------------------------------------------------------------------
    186,895  observations remaining, representing
     24,763  failures in single-record/single-failure data
   60202610  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       359

.   1,610
  625
  2,559

. 
. 
. drop if group==2 & entrydate<d(1/1/2019)
(9,477 observations deleted)

. 
. 
. 
. foreach csoutcome of any DENOM otherinfections cancer_ex_nmsc endo_nutr_metabol mentalhealth nervoussystem circulatory respiratorylrti respiratory digestive musculoskeletal genitourinary external {
  2. 
. foreach group of numlist 1 2 4 {
  3. 
. if "`csoutcome'"=="DENOM" local condition 
  4. else local condition " & CSfail_`csoutcome' == 1"
  5. if `group'==1 & "`csoutcome'"!="DENOM" file write tablecontent ("`csoutcome'") _tab 
  6. 
. cou if group==`group' `condition'
  7. if "`csoutcome'"!="DENOM" file write tablecontent (r(N))
  8. if "`csoutcome'"=="DENOM" local denominator`group' = r(N)
  9. if "`csoutcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`denominator`group'') (")")
 10. if `group'<4 file write tablecontent _tab
 11. else file write tablecontent _n
 12. }
 13. 
. if "`csoutcome'"=="DENOM" file write tablecontent _n 
 14. 
. }
  15,901
  6,745
  79,502
  331
  242
  360
  428
  330
  1,019
  179
  93
  230
  210
  63
  265
  202
  111
  329
  815
  469
  1,545
  1,656
  629
  616
  542
  511
  535
  575
  396
  1,838
  119
  130
  722
  471
  264
  879
  333
  178
  574

. 
. file close tablecontent

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/output/an_descriptive.log
  log type:  text
 closed on:   1 Apr 2021, 17:15:23
------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
