-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_descriptive.log
  log type:  text
 opened on:   2 Apr 2021, 01:47:01

. use analysis/cr_append_process_data, clear

. 
. preserve

. keep if group==1|group==4
(91,736 observations deleted)

. bysort setid: gen groupsize = _N

. tab groupsize if group==1

  groupsize |      Freq.     Percent        Cum.
------------+-----------------------------------
          3 |REDACTED
          6 |REDACTED		>99.99      100.00
------------+-----------------------------------
      Total |     15,901      100.00

. restore

. 
. 
. histogram entrydate if (group==1|group==2|group==4), by(group, cols(1)) 

. graph export analysis/output/an_descriptive_EVENTSBYTIME.svg, as(svg) replace
(note: file analysis/output/an_descriptive_EVENTSBYTIME.svg not found)
(file analysis/output/an_descriptive_EVENTSBYTIME.svg written in SVG format)

. 
. gen monthyrentry = year(entrydate) * 100 + month(entrydate)

. 
. safetab monthyrent group  if group==2 & entrydate<d(1/11/2019)

monthyrent |   group
        ry | Hospitali |     Total
-----------+-----------+----------
    201701 |       387 |       387 
    201702 |       584 |       584 
    201703 |       302 |       302 
    201704 |        80 |        80 
    201705 |        65 |        65 
    201706 |        23 |        23 
    201707 |        14 |        14 
    201708 |         6 |         6 
    201709 |        19 |        19 
    201710 |        28 |        28 
    201711 |        34 |        34 
    201712 |       248 |       248 
    201801 |     2,056 |     2,056 
    201802 |     2,145 |     2,145 
    201803 |     1,928 |     1,928 
    201804 |       975 |       975 
    201805 |       181 |       181 
    201806 |        39 |        39 
    201807 |        20 |        20 
    201808 |         7 |         7 
    201809 |        17 |        17 
    201810 |        29 |        29 
    201811 |        59 |        59 
    201812 |       231 |       231 
    201901 |     1,648 |     1,648 
    201902 |     2,550 |     2,550 
    201903 |     1,496 |     1,496 
    201904 |       590 |       590 
    201905 |       219 |       219 
    201906 |        67 |        67 
    201907 |        37 |        37 
    201908 |        21 |        21 
    201909 |        34 |        34 
    201910 |        80 |        80 
-----------+-----------+----------
     Total |    16,219 |    16,219 

. 
. safetab readmission group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

readmissio |                    group
         n | Hospitali  Hospitali  Hospitali  General p |     Total
-----------+--------------------------------------------+----------
         0 |    11,107      9,076     39,430     67,905 |   127,518 
           |     69.85      55.95      52.22      85.41 |     68.14 
-----------+--------------------------------------------+----------
         1 |       322          0          0          0 |       322 
           |      2.03       0.00       0.00       0.00 |      0.17 
-----------+--------------------------------------------+----------
         2 |     3,885      6,873     32,218     11,214 |    54,190 
           |     24.43      42.37      42.66      14.11 |     28.96 
-----------+--------------------------------------------+----------
         3 |       587        273      3,866        383 |     5,109 
           |      3.69       1.68       5.12       0.48 |      2.73 
-----------+--------------------------------------------+----------
     Total |    15,901     16,222     75,514     79,502 |   187,139 
           |    100.00     100.00     100.00     100.00 |    100.00 

. 
. safetab readm_reason_b group, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |                    group
   readm_reason_broad | Hospitali  Hospitali  Hospitali  General p |     Total
----------------------+--------------------------------------------+----------
                 None |    11,107      9,076     39,430     67,905 |   127,518 
                      |     70.45      56.71      52.73      85.78 |     68.66 
----------------------+--------------------------------------------+----------
 Other infections (A) |       159        261      1,560        210 |     2,190 
                      |      1.01       1.63       2.09       0.27 |      1.18 
----------------------+--------------------------------------------+----------
          Cancers (C) |       210        559      2,669        876 |     4,314 
                      |      1.33       3.49       3.57       1.11 |      2.32 
----------------------+--------------------------------------------+----------
Endocrine, nutritiona |       106        136        716        186 |     1,144 
                      |      0.67       0.85       0.96       0.23 |      0.62 
----------------------+--------------------------------------------+----------
Mental and behavioura |        69         62        412        121 |       664 
                      |      0.44       0.39       0.55       0.15 |      0.36 
----------------------+--------------------------------------------+----------
   Nervous system (G) |        89        136        434        193 |       852 
                      |      0.56       0.85       0.58       0.24 |      0.46 
----------------------+--------------------------------------------+----------
      Circulatory (I) |       435        668      3,608      1,103 |     5,814 
                      |      2.76       4.17       4.82       1.39 |      3.13 
----------------------+--------------------------------------------+----------
COVID/Influenza/Pneum |       351        716      4,538        401 |     6,006 
                      |      2.23       4.47       6.07       0.51 |      3.23 
----------------------+--------------------------------------------+----------
 Respiratory (J23-99) |       288        672      3,573        349 |     4,882 
                      |      1.83       4.20       4.78       0.44 |      2.63 
----------------------+--------------------------------------------+----------
        Digestive (K) |       331        618      2,595      1,539 |     5,083 
                      |      2.10       3.86       3.47       1.94 |      2.74 
----------------------+--------------------------------------------+----------
  Musculoskeletal (M) |       194        423      1,252      1,066 |     2,935 
                      |      1.23       2.64       1.67       1.35 |      1.58 
----------------------+--------------------------------------------+----------
    Genitourinary (N) |       274        333      1,900        636 |     3,143 
                      |      1.74       2.08       2.54       0.80 |      1.69 
----------------------+--------------------------------------------+----------
External causes (S-Y  |       266        345      1,972        754 |     3,337 
                      |      1.69       2.16       2.64       0.95 |      1.80 
----------------------+--------------------------------------------+----------
                Other |     1,300      1,727      6,255      3,443 |    12,725 
                      |      8.25      10.79       8.36       4.35 |      6.85 
----------------------+--------------------------------------------+----------
      Any cause death |       587        273      3,866        383 |     5,109 
                      |      3.72       1.71       5.17       0.48 |      2.75 
----------------------+--------------------------------------------+----------
                Total |    15,766     16,005     74,780     79,165 |   185,716 
                      |    100.00     100.00     100.00     100.00 |    100.00 

. 
. cap file close tablecontent

. file open tablecontent using ./analysis/output/an_descriptive_OUTCOMES.txt, w
> rite text replace
(note: file ./analysis/output/an_descriptive_OUTCOMES.txt not found)

. 
. gen byte cons=1

. 
. foreach outcome of any DENOM composite death{
  2. if "`outcome'"=="death" include analysis/stsetfordeath1ocare.doi
  3. 
. foreach group of numlist 1 2 4 {
  4.         
. if `group'==1 file write tablecontent ("`outcome'") _tab 
  5. 
. if "`outcome'"=="DENOM" local condition 
  6. else local condition " & _d==1"
  7. 
. cou if group==`group' `condition'
  8. file write tablecontent (r(N))
  9. if "`outcome'"=="DENOM" local denominator`group' = r(N)
 10. if "`outcome'"=="DENOM" & `group'==2{
 11.         cou if group==2 & entrydate>=d(1/1/2019)
 12.         file write tablecontent (" (") (r(N)) (" in 2019*)")
 13. }
 14. if "`outcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`de
> nominator`group'') (")")
 15. if `group'<4 file write tablecontent _tab
 16. else file write tablecontent _n
 17. 
. }
 18. 
. if "`outcome'"=="DENOM" file write tablecontent _n 
 19. }
  15,901
  16,222
  6,745
  79,502
  4,755
  7,146
  11,566

. 
. *all use 1ocare
. 
. *Code chunk for looking at death outcome
. 
. summ died_date_ons, f d

                        died_date_ons
-------------------------------------------------------------
      Percentiles      Smallest
 1%    17mar2019      01feb2019
 5%    03may2019      01feb2019
10%    12jun2019      01feb2019       Obs              37,000
25%    19sep2019      01feb2019       Sum of Wgt.      37,000

50%    08feb2020                      Mean          26feb2020
                        Largest       Std. Dev.      199.3367
75%    05aug2020      12mar2021
90%    21dec2020      12mar2021       Variance       39735.13
95%    24jan2021      12mar2021       Skewness       .1845416
99%    26feb2021      14mar2021       Kurtosis       1.955246

. scalar deathcensor = r(max)-30

. gen deathexit = died_date_1ocare if died_date_1ocare<deathcensor 
(152,118 missing values generated)

. gen deathindicator = died_date_1ocare<(dereg_date) 

. 
. replace deathexit = min(deathcensor, dereg_date) if deathexit==. 
(152,118 real changes made)

. 
. gen deathfup = deathexit-entrydate

. summ deathfup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    deathfup |     15,901    234.3599    85.82806        -24        359

. local maxfupexposed = r(max)

. replace deathindicator = 0 if deathexit>(entrydate + `maxfupexposed')
(11,245 real changes made)

. replace deathexit = entrydate + r(max) if deathexit>(entrydate + `maxfupexpos
> ed')
(144,668 real changes made)

. stset deathexit, enter(entrydate) fail(deathindicator) origin(entrydate)

     failure event:  deathindicator != 0 & deathindicator < .
obs. time interval:  (origin, deathexit]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    187,139  total observations
        505  observations end on or before enter()
------------------------------------------------------------------------------
    186,634  observations remaining, representing
     23,816  failures in single-record/single-failure data
   59446456  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       359

.   1,559
  1,406
  2,360

. 
. 
. drop if group==2 & entrydate<d(1/1/2019)
(9,477 observations deleted)

. 
. 
. 
. foreach csoutcome of any DENOM otherinfections cancer_ex_nmsc endo_nutr_metab
> ol mentalhealth nervoussystem circulatory respiratorylrti respiratory digesti
> ve musculoskeletal genitourinary external {
  2. 
. foreach group of numlist 1 2 4 {
  3. 
. 
. if "`csoutcome'"=="DENOM" local condition 
  4. else{
  5.         stset CSexit_`csoutcome', fail(CSfail_`csoutcome') origin(entrydat
> e) enter(entrydate) 
  6.         local condition " & _d == 1"
  7.         if `group'==1 file write tablecontent ("`csoutcome'") _tab 
  8. }
  9. 
. cou if group==`group' `condition'
 10. if "`csoutcome'"!="DENOM" file write tablecontent (r(N))
 11. if "`csoutcome'"=="DENOM" local denominator`group' = r(N)
 12. if "`csoutcome'"!="DENOM" file write tablecontent (" (") %3.1f (100*r(N)/`
> denominator`group'') (")")
 13. if `group'<4 file write tablecontent _tab
 14. else file write tablecontent _n
 15. }
 16. 
. if "`csoutcome'"=="DENOM" file write tablecontent _n 
 17. 
. }
  15,901
  6,745
  79,502

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        581  observations end on or before enter()
------------------------------------------------------------------------------
    177,081  observations remaining, representing
      3,669  failures in single-record/single-failure data
   26697672  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  304

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        581  observations end on or before enter()
------------------------------------------------------------------------------
    177,081  observations remaining, representing
      3,669  failures in single-record/single-failure data
   26697672  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  225

     failure event:  CSfail_otherinfections != 0 & CSfail_otherinfections < .
obs. time interval:  (origin, CSexit_otherinfections]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        581  observations end on or before enter()
------------------------------------------------------------------------------
    177,081  observations remaining, representing
      3,669  failures in single-record/single-failure data
   26697672  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  359

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        379  observations end on or before enter()
------------------------------------------------------------------------------
    177,283  observations remaining, representing
      7,258  failures in single-record/single-failure data
   26575549  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  412

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        379  observations end on or before enter()
------------------------------------------------------------------------------
    177,283  observations remaining, representing
      7,258  failures in single-record/single-failure data
   26575549  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  321

     failure event:  CSfail_cancer_ex_nmsc != 0 & CSfail_cancer_ex_nmsc < .
obs. time interval:  (origin, CSexit_cancer_ex_nmsc]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        379  observations end on or before enter()
------------------------------------------------------------------------------
    177,283  observations remaining, representing
      7,258  failures in single-record/single-failure data
   26575549  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  1,016

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        285  observations end on or before enter()
------------------------------------------------------------------------------
    177,377  observations remaining, representing
      1,640  failures in single-record/single-failure data
   26878053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  158

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        285  observations end on or before enter()
------------------------------------------------------------------------------
    177,377  observations remaining, representing
      1,640  failures in single-record/single-failure data
   26878053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  85

     failure event:  CSfail_endo_nutr_metabol != 0 & CSfail_endo_nutr_metabol <
>  .
obs. time interval:  (origin, CSexit_endo_nutr_metabol]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        285  observations end on or before enter()
------------------------------------------------------------------------------
    177,377  observations remaining, representing
      1,640  failures in single-record/single-failure data
   26878053  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  230

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        272  observations end on or before enter()
------------------------------------------------------------------------------
    177,390  observations remaining, representing
      1,802  failures in single-record/single-failure data
   26937120  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  185

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        272  observations end on or before enter()
------------------------------------------------------------------------------
    177,390  observations remaining, representing
      1,802  failures in single-record/single-failure data
   26937120  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  54

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        272  observations end on or before enter()
------------------------------------------------------------------------------
    177,390  observations remaining, representing
      1,802  failures in single-record/single-failure data
   26937120  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  264

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        294  observations end on or before enter()
------------------------------------------------------------------------------
    177,368  observations remaining, representing
      1,830  failures in single-record/single-failure data
   26901343  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  180

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        294  observations end on or before enter()
------------------------------------------------------------------------------
    177,368  observations remaining, representing
      1,830  failures in single-record/single-failure data
   26901343  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  107

     failure event:  CSfail_nervoussystem != 0 & CSfail_nervoussystem < .
obs. time interval:  (origin, CSexit_nervoussystem]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        294  observations end on or before enter()
------------------------------------------------------------------------------
    177,368  observations remaining, representing
      1,830  failures in single-record/single-failure data
   26901343  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  329

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,399  observations end on or before enter()
------------------------------------------------------------------------------
    176,263  observations remaining, representing
      9,088  failures in single-record/single-failure data
   26241565  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  717

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,399  observations end on or before enter()
------------------------------------------------------------------------------
    176,263  observations remaining, representing
      9,088  failures in single-record/single-failure data
   26241565  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  447

     failure event:  CSfail_circulatory != 0 & CSfail_circulatory < .
obs. time interval:  (origin, CSexit_circulatory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,399  observations end on or before enter()
------------------------------------------------------------------------------
    176,263  observations remaining, representing
      9,088  failures in single-record/single-failure data
   26241565  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  1,537

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      3,210  observations end on or before enter()
------------------------------------------------------------------------------
    174,452  observations remaining, representing
      9,004  failures in single-record/single-failure data
   25938275  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  1,064

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      3,210  observations end on or before enter()
------------------------------------------------------------------------------
    174,452  observations remaining, representing
      9,004  failures in single-record/single-failure data
   25938275  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  417

     failure event:  CSfail_respiratorylrti != 0 & CSfail_respiratorylrti < .
obs. time interval:  (origin, CSexit_respiratorylrti]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      3,210  observations end on or before enter()
------------------------------------------------------------------------------
    174,452  observations remaining, representing
      9,004  failures in single-record/single-failure data
   25938275  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  615

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,022  observations end on or before enter()
------------------------------------------------------------------------------
    176,640  observations remaining, representing
      7,238  failures in single-record/single-failure data
 26378639.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  485

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,022  observations end on or before enter()
------------------------------------------------------------------------------
    176,640  observations remaining, representing
      7,238  failures in single-record/single-failure data
 26378639.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  437

     failure event:  CSfail_respiratory != 0 & CSfail_respiratory < .
obs. time interval:  (origin, CSexit_respiratory]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
      1,022  observations end on or before enter()
------------------------------------------------------------------------------
    176,640  observations remaining, representing
      7,238  failures in single-record/single-failure data
 26378639.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  534

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        584  observations end on or before enter()
------------------------------------------------------------------------------
    177,078  observations remaining, representing
      6,707  failures in single-record/single-failure data
 26364154.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  528

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        584  observations end on or before enter()
------------------------------------------------------------------------------
    177,078  observations remaining, representing
      6,707  failures in single-record/single-failure data
 26364154.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  377

     failure event:  CSfail_digestive != 0 & CSfail_digestive < .
obs. time interval:  (origin, CSexit_digestive]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        584  observations end on or before enter()
------------------------------------------------------------------------------
    177,078  observations remaining, representing
      6,707  failures in single-record/single-failure data
 26364154.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  1,836

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        207  observations end on or before enter()
------------------------------------------------------------------------------
    177,455  observations remaining, representing
      1,903  failures in single-record/single-failure data
 26848264.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  114

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        207  observations end on or before enter()
------------------------------------------------------------------------------
    177,455  observations remaining, representing
      1,903  failures in single-record/single-failure data
 26848264.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  129

     failure event:  CSfail_musculoskeletal != 0 & CSfail_musculoskeletal < .
obs. time interval:  (origin, CSexit_musculoskeletal]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        207  observations end on or before enter()
------------------------------------------------------------------------------
    177,455  observations remaining, representing
      1,903  failures in single-record/single-failure data
 26848264.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  718

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        567  observations end on or before enter()
------------------------------------------------------------------------------
    177,095  observations remaining, representing
      4,695  failures in single-record/single-failure data
 26573949.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  424

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        567  observations end on or before enter()
------------------------------------------------------------------------------
    177,095  observations remaining, representing
      4,695  failures in single-record/single-failure data
 26573949.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  245

     failure event:  CSfail_genitourinary != 0 & CSfail_genitourinary < .
obs. time interval:  (origin, CSexit_genitourinary]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        567  observations end on or before enter()
------------------------------------------------------------------------------
    177,095  observations remaining, representing
      4,695  failures in single-record/single-failure data
 26573949.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  878

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        508  observations end on or before enter()
------------------------------------------------------------------------------
    177,154  observations remaining, representing
      3,232  failures in single-record/single-failure data
 26709351.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  310

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        508  observations end on or before enter()
------------------------------------------------------------------------------
    177,154  observations remaining, representing
      3,232  failures in single-record/single-failure data
 26709351.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  164

     failure event:  CSfail_external != 0 & CSfail_external < .
obs. time interval:  (origin, CSexit_external]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
    177,662  total observations
        508  observations end on or before enter()
------------------------------------------------------------------------------
    177,154  observations remaining, representing
      3,232  failures in single-record/single-failure data
 26709351.5  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       274
  572

. 
. file close tablecontent

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_descriptive.log
  log type:  text
 closed on:   2 Apr 2021, 01:47:23
-------------------------------------------------------------------------------
