-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/an_flow.log
  log type:  text
 opened on:   6 May 2021, 15:55:15

. 
. clear

. noi di "importing csv"
importing csv

. import delimited ./output/input_covdischarged.csv
(102 vars, 117,032 obs)

. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  117,032

. 
. qui{

. 
. ********* DEFAULT CENSORING IS MAX OUTCOME DATE MINUS 7 **********
. summ died_date_ons

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     38,643    22202.41    120.2172      21977      22379

. global deathcensor = r(max)-7

. 
. 
. noi di _dup(30) "*"
******************************

. noi di "COUNTS START HERE"
COUNTS START HERE

. noi di _dup(30) "*"
******************************

. cou
  117,032

. 
. *tie together admissions that are within 1 week of previous discharge
. gen finaldischargedate = discharged1_date

. replace finaldischargedate = discharged2_date if admitted2_date<=(discharged1
> _date+7)
(12,236 real changes made)

. replace finaldischargedate = discharged3_date if admitted2_date<=(discharged1
> _date+7) & admitted3_date<=(discharged2_date+7)
(1,625 real changes made)

. replace finaldischargedate = discharged4_date if admitted2_date<=(discharged1
> _date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged
> 3_date+7)
(281 real changes made)

. format %d finaldischargedate

. *drop if there is a single day admission in the chain of admissions, as canno
> t then get f-up:
. drop if finaldischargedate==discharged4_date & discharged4_date == admitted4_
> date
(8,724 observations deleted)

. *drop if we get to the 5th readmission with all short gaps
. drop if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_d
> ate+7) & admitted4_date<=(discharged3_date+7) & admitted5_date<=(discharged4_
> date+7)
(62 observations deleted)

. 
. gen entrydate = finaldischargedate+8

. format %d entrydate

. 
. cou
  108,246

. 
. local diedsource "ons"

. *drop if died date on/before discharge date
. cou if died_date_`diedsource'<entrydate /*total*/
  30,070

. 
. cou if died_date_`diedsource'==finaldischargedate
  25,029

. cou if died_date_`diedsource'<finaldischargedate
  3,139

. cou if died_date_`diedsource'<=finaldischargedate /*died during hosp*/
  28,168

. cou
  108,246

. cou if died_date_`diedsource'>finaldischargedate & died_date_`diedsource'<ent
> rydate /*died within 7d of discharge*/
  1,902

. drop if died_date_`diedsource'<entrydate
(30,070 observations deleted)

. cou
  78,176

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(78,176 real changes made)

. replace imd = . if imd_o==-1
(593 real changes made, 593 to missing)

. drop imd_o

. 
. 
. 
. cou if age>105|(sex!="M"&sex!="F")| imd==.
  597

. 
. drop if age>105
(<=5 observation deleted)

. 
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(<=5 observations deleted)

. 
. drop if imd==.
(593 observations deleted)

. 
. cou
  77,579

. 
. /*
> *FURTHER EXCLUSIONS AND DATE PROCESSING:
> *drop if initial admission/discharge are on the same day
> drop if admitted1_date==discharged1_date
> */
. 
. 
. 
. 
. *drop if later than 60d before latest sus data
. summ discharged1_date, f d

                      discharged1_date
-------------------------------------------------------------

REDACTED
latest is 28 feb

. scalar censordate = r(max) - 60

. drop if entrydate>=censordate
(35,108 observations deleted)

. 
. cou
  42,471

. 
. *Only keep if COVID/FLU was the primary reason for hospitalisation
. keep if admitted1_reason=="U071"|admitted1_reason=="U072"
(17,373 observations deleted)

. cou 
  25,098

. 
. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/an_flow.log
  log type:  text
 closed on:   6 May 2021, 15:55:26
-------------------------------------------------------------------------------
