------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/output/an_flow.log
  log type:  text
 opened on:  22 Mar 2021, 12:37:01

. 
. clear

. noi di "importing csv"
importing csv

. import delimited ./output/input_covdischarged.csv
(63 vars, 69,835 obs)

. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  69,835

. 
. qui{

. 
. ********* DEFAULT CENSORING IS MAX OUTCOME DATE MINUS 7 **********
. summ died_date_ons

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     24,202    22139.25    109.3433      21977      22337

. global deathcensor = r(max)-7

. 
. 
. noi di _dup(30) "*"
******************************

. noi di "COUNTS START HERE"
COUNTS START HERE

. noi di _dup(30) "*"
******************************

. cou
  69,835

. 
. *tie together admissions that are within 1 week of previous discharge
. gen finaldischargedate = discharged1_date

. replace finaldischargedate = discharged2_date if admitted2_date<=(discharged1_date+7)
(6,580 real changes made)

. replace finaldischargedate = discharged3_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7)
(889 real changes made)

. replace finaldischargedate = discharged4_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7)
(175 real changes made)

. format %d finaldischargedate

. *drop if there is a single day admission in the chain of admissions, as cannot then get f-up:
. drop if finaldischargedate==discharged4_date & discharged4_date == admitted4_date
(5,295 observations deleted)

. *drop if we get to the 5th readmission with all short gaps
. drop if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7) & admitted5_date<=(discharged4_date+7)
(46 observations deleted)

. 
. gen entrydate = finaldischargedate+8

. format %d entrydate

. 
. cou
  64,494

. 
. local diedsource "ons"

. *drop if died date on/before discharge date
. cou if died_date_`diedsource'<entrydate /*total*/
  18,352

. 
. cou if died_date_`diedsource'==finaldischargedate
  15,436

. cou if died_date_`diedsource'<finaldischargedate
  1,786

. cou if died_date_`diedsource'<=finaldischargedate /*died during hosp*/
  17,222

. cou
  64,494

. cou if died_date_`diedsource'>finaldischargedate & died_date_`diedsource'<entrydate /*died within 7d of discharge*/
  1,130

. drop if died_date_`diedsource'<entrydate
(18,352 observations deleted)

. cou
  46,142

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(46,142 real changes made)

. replace imd = . if imd_o==-1
(328 real changes made, 328 to missing)

. drop imd_o

. 
. 
. 
. cou if age>105|(sex!="M"&sex!="F")| imd==.
  330

. 
. drop if age>105
[REDACTED]
. 
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
[REDACTED]

. 
. drop if imd==.
(328 observations deleted)

. 
. cou
  45,812

. 
. /*
> *FURTHER EXCLUSIONS AND DATE PROCESSING:
> *drop if initial admission/discharge are on the same day
> drop if admitted1_date==discharged1_date
> */
. 
. 
. 
. 
. *drop if later than 60d before latest sus data
. summ discharged1_date, f d

                      discharged1_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    24mar2020      08feb2020
 5%    02apr2020      11feb2020
10%    09apr2020      14feb2020       Obs              45,812
25%    29apr2020      14feb2020       Sum of Wgt.      45,812

50%    24sep2020                      Mean          16aug2020
                        Largest       Std. Dev.      103.3272
75%    23nov2020      31dec2020
90%    17dec2020      31dec2020       Variance       10676.52
95%    24dec2020      31dec2020       Skewness      -.0966015
99%    31dec2020      31dec2020       Kurtosis       1.251425

. scalar censordate = r(max) - 60

. drop if entrydate>=censordate
(20,137 observations deleted)

. 
. cou
  25,675

. 
. *Only keep if COVID/FLU was the primary reason for hospitalisation
. keep if admitted1_reason=="U071"|admitted1_reason=="U072"
(9,771 observations deleted)

. cou 
  15,904

. wd
command wd is unrecognized
r(199);

end of do-file

r(199);

. do "E:\STATATMP\STD48e0_000000.tmp"

. do analysis/cr_create_analysis_dataset COVID

. ********************************************************************************
. *
. *       Do-file:                cr_create_analysis_dataset.do
. *
. *       Project:                Post COVID-admission admissions
. *
. *       Programmed by:  Krishnan, Fizz
. *
. *       Data used:              Data in memory (from input.csv)
. *
. *       Data created:   cr_create_analysis_dataset.dta  
. *
. *       Other output:   None
. *
. ********************************************************************************
. *
. *       Purpose:                This do-file creates the variables required for the 
. *                                       main analysis and saves into Stata datasets.
. *  
. ********************************************************************************
. 
. local cpf "`1'"

. 
. * Open a log file
. cap log close
