-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/output/an_flow.log
  log type:  text
 opened on:   9 May 2021, 14:18:36

. 
. clear

. noi di "importing csv"
importing csv

. import delimited ./output/input_covdischarged.csv
(102 vars, 117,032 obs)

. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  117,032

. 
. *correction
. cap rename admitted1_dishcargedestination admitted1_dischargedestination

. cap rename admitted1_dishchargedestination admitted1_dischargedestination

. 
. for num 2/5: cap rename admittedX_dishchargedestination admittedX_dischargedestination

->  cap rename admitted2_dishchargedestination admitted2_dischargedestination

->  cap rename admitted3_dishchargedestination admitted3_dischargedestination

->  cap rename admitted4_dishchargedestination admitted4_dischargedestination

->  cap rename admitted5_dishchargedestination admitted5_dischargedestination

. 
. 
. qui{

. 
. ********* DEFAULT CENSORING IS MAX OUTCOME DATE MINUS 7 **********
. summ died_date_ons

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
died_date_~s |     38,643    22202.41    120.2172      21977      22379

. global deathcensor = r(max)-7

. 
. 
. noi di _dup(30) "*"
******************************

. noi di "COUNTS START HERE"
COUNTS START HERE

. noi di _dup(30) "*"
******************************

. cou
  117,032

. 
. *tie together admissions that are within 1 week of previous discharge
. /*
> gen finaldischargedate = discharged1_date
> replace finaldischargedate = discharged2_date if admitted2_date<=(discharged1_date+7)
> replace finaldischargedate = discharged3_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7)
> replace finaldischargedate = discharged4_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7)
> format %d finaldischargedate
> *drop if there is a single day admission in the chain of admissions, as cannot then get f-up:
> drop if finaldischargedate==discharged4_date & discharged4_date == admitted4_date
> *drop if we get to the 5th readmission with all short gaps
> drop if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7) & admitted5_date<=(discharged4_date+7)
> */
. 
. *tie together admissions that are within 1 week of previous discharge
. gen finaldischargedate = discharged1_date

. gen finaldischargedest = admitted1_dischargedestination
(36 missing values generated)

. 
. replace finaldischargedate = discharged2_date if admitted2_date<=(discharged1_date+7)
(12,236 real changes made)

. replace finaldischargedest = admitted2_dischargedestination if admitted2_date<=(discharged1_date+7)
(8,204 real changes made, 3,637 to missing)

. 
. replace finaldischargedate = discharged3_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7)
(1,625 real changes made)

. replace finaldischargedest = admitted3_dischargedestination if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7)
(823 real changes made, 403 to missing)

. 
. replace finaldischargedate = discharged4_date if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7)
(281 real changes made)

. replace finaldischargedest = admitted4_dischargedestination if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7)
(125 real changes made, 73 to missing)

. 
. format %d finaldischargedate

. 
. 
. *drop if there is a single day admission in the chain of admissions, as cannot then get f-up:
. drop if finaldischargedate==discharged4_date & discharged4_date == admitted4_date
(8,724 observations deleted)

. cou
  108,308

. 
. *drop if hospital transfer
. ***************
. cou if (admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7) & admitted5_date<=(discharged4_date+7)) ///
>         | (finaldischargedest==30|(finaldischargedest>=48 & finaldischargedest<=53)|finaldischargedest==84|finaldischargedest==87) ///
>         | (finaldischargedest==88) 
  2,243

. ***************
. *drop if we get to the 5th readmission with all short gaps
. drop if admitted2_date<=(discharged1_date+7) & admitted3_date<=(discharged2_date+7) & admitted4_date<=(discharged3_date+7) & admitted5_date<=(discharged4_date+7)
(62 observations deleted)

. *drop if the final discharge destination is to hospital transfer, or to hospice
. drop if finaldischargedest==30|(finaldischargedest>=48 & finaldischargedest<=53)|finaldischargedest==84|finaldischargedest==87 /*hospital transfers*/
(1,941 observations deleted)

. drop if finaldischargedest==88 /*hospice*/
(240 observations deleted)

. 
. cou
  106,065

. 
. 
. gen entrydate = finaldischargedate+8

. format %d entrydate

. 
. 
. 
. local diedsource "ons"

. *drop if died date on/before discharge date
. cou if died_date_`diedsource'<entrydate|finaldischargedest==79  /*total*/
  30,225

. 
. cou if died_date_`diedsource'==finaldischargedate|finaldischargedest==79  
  28,562

. cou if died_date_`diedsource'<finaldischargedate 
  3,129

. ***************
. cou if died_date_`diedsource'<=finaldischargedate|finaldischargedest==79   /*died during hosp*/
  28,652

. ***************
. cou
  106,065

. ***************
. cou if died_date_`diedsource'>finaldischargedate & died_date_`diedsource'<entrydate & finaldischargedest!=79 /*died within 7d of discharge*/
  1,573

. ***************
. drop if died_date_`diedsource'<entrydate|finaldischargedest==79  
(30,225 observations deleted)

. cou
  75,840

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. replace imd = imd + 1
(75,840 real changes made)

. replace imd = . if imd_o==-1
(583 real changes made, 583 to missing)

. drop imd_o

. 
. 
. 
. cou if age>105|(sex!="M"&sex!="F")| imd==.
  587

. 
. drop if age>105
(1 observation deleted)

. 
. assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(3 observations deleted)

. 
. drop if imd==.
(583 observations deleted)

. 
. cou
  75,253

. 
. /*
> *FURTHER EXCLUSIONS AND DATE PROCESSING:
> *drop if initial admission/discharge are on the same day
> drop if admitted1_date==discharged1_date
> */
. 
. 
. 
. 
. *drop if later than 60d before latest sus data
. summ discharged1_date, f d

                      discharged1_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    27mar2020      08feb2020
 5%    07apr2020      11feb2020
10%    16apr2020      14feb2020       Obs              75,253
25%    15jun2020      14feb2020       Sum of Wgt.      75,253

50%    05dec2020                      Mean          20oct2020
                        Largest       Std. Dev.      112.7906
75%    18jan2021      28feb2021
90%    05feb2021      28feb2021       Variance       12721.73
95%    15feb2021      28feb2021       Skewness      -.7523006
99%    25feb2021      28feb2021       Kurtosis       1.942466

. scalar censordate = r(max) - 60

. drop if entrydate>=censordate
(33,711 observations deleted)

. 
. cou
  41,542

. 
. *Only keep if COVID/FLU was the primary reason for hospitalisation
. keep if admitted1_reason=="U071"|admitted1_reason=="U072"
(16,869 observations deleted)

. cou 
  24,673

. 
. 
. log close
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/output/an_flow.log
  log type:  text
 closed on:   9 May 2021, 14:18:43
-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
