------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/an_posthoc_mentalhealth.log
  log type:  text
 opened on:   1 Apr 2021, 22:01:30

.         
. use analysis/cr_append_process_data, clear

. drop if group==3|group==4
(155,016 observations deleted)

. drop if group==2 & entrydate<d(1/1/2019)
(9,477 observations deleted)

. 
. 
. stset CSexit_mentalhealth, fail(CSfail_mentalhealth) origin(entrydate) enter(entrydate) 

     failure event:  CSfail_mentalhealth != 0 & CSfail_mentalhealth < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
        239  failures in single-record/single-failure data
  3,809,129  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       266

. gen fup = _t-_t0 
(61 missing values generated)

. summ fup if group==1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         fup |     15,867    142.1318    69.19538         .5        256

. scalar fupcovid = r(mean)*r(N)

. 
. summ fup if group==2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         fup |      6,718    231.3075    56.74238         .5        266

. scalar fupflu = r(mean)*r(N)

. 
. gen mentalhealthicd3 = substr(admitted_mentalhealth_reason, 1, 3)
(22,433 missing values generated)

. gen icdnumeric = real(substr(mentalhealthicd3,2,2))
(22,433 missing values generated)

. 
. gen mentalhealthgrouped = "Dementia (F00-F03)" if icdnumer>=0 & icdnumer<=3
(22,611 missing values generated)

. replace mentalhealthgrouped = "Delirium (F05)" if icdnumeric==5
(134 real changes made)

. replace mentalhealthgrouped = "Schizophrenia/schizotypal/delusional disorders (F20-29)" if icdnumeric>=20 & icdnumeric<=29
variable mentalhealthgrouped was str18 now str55
(7 real changes made)

. replace mentalhealthgrouped = "Mood disorders (F30-39)" if icdnumeric>=30 & icdnumeric<=39
(11 real changes made)

. replace mentalhealthgrouped = "Neurotic/stress-related/somatoform disorders (F40-48)" if icdnumeric>=40 & icdnumeric<=49
(22 real changes made)

. 
. encode mentalhealthgrouped, gen(mentalhealthgrouped_n)

. 
. /*gen fail_exdem = CSfail_mentalhealth
> replace fail_exdem = 0 if substr(mentalhealthgrouped,1,3)!="Dem"
> 
> 
> stcox exposed age male i.region_real if group==1|group==2
> stcox exposed age male i.region_real i.ethnicity i.imd i.obese4cat i.smoke_nomiss htdiag chronic_respiratory_disease i.asthmacat chronic_cardi
> ac_disease i.diabcat i.cancer_exhaem_cat i.cancer_haem_cat i.reduced_kidney_function_cat2 chronic_liver_disease stroke dementia other_neuro or
> gan_transplant spleen ra_sle_psoriasis other_immunosuppression if group==1|group==2 
> */
. /*
> gen fail2 = CSfail_mentalhealth
> replace fail2 = 0 if substr(mentalhealthgrouped,1,3)!="Dem"
> streset, fail(fail2)
> 
> stmh group, c(1,2) by(agegroup male)
> stcox ib2.group age male dementia
> stcox ib2.group age male if dementia==0
> */
. foreach run of any dem demexdem del sch moo neu all{
  2. preserve
  3. local failtype = substr("`run'",1,3)
  4. if "`run'"=="demexdem" drop if dementia==1
  5. if "`run'"=="all" replace mentalhealthgrouped = "All except dementia (F05-F99)" if icdnumeric>=5 & icdnumeric<.
  6. tempfile temp`run'
  7. gen fail`failtype' = CSfail_mentalhealth
  8. replace fail`failtype' = 0 if substr(lower(mentalhealthgrouped),1,3)!="`failtype'"
  9. streset, fail(fail`failtype') scale(365.25)
 10. strate group, per(1000) output(`temp`run'')
 11. stcox ib2.group age male 
 12. lincom 1.group, hr
 13. local hr = r(estimate)
 14. local lci = r(lb)
 15. local uci = r(ub)
 16. restore
 17. preserve
 18. use `temp`run'', clear
 19. gen str8 failtype = "`run'"
 20. gen hr = `hr' if _n==1
 21. gen lci = `lci' if _n==1
 22. gen uci = `uci' if _n==1
 23. save, replace
 24. restore
 25. }
(231 real changes made)
-> stset CSexit_mentalhealth, failure(faildem) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  faildem != 0 & faildem < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
         27  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  faildem
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +----------------------------------------------------------------------+
  |                    group    D        Y      Rate     Lower     Upper |
  |----------------------------------------------------------------------|
  |    Hospitalised COVID-19   24   6.1744   3.88701   2.60534   5.79918 |
  | Hospitalised flu 2017_19    3   4.2544   0.70515   0.22743   2.18637 |
  +----------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  faildem
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -263.88672
Iteration 1:   log likelihood = -237.28114
Iteration 2:   log likelihood = -233.22862
Iteration 3:   log likelihood = -233.00278
Iteration 4:   log likelihood = -233.00185
Refining estimates:
Iteration 0:   log likelihood = -233.00185

Cox regression -- Breslow method for ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =           27
Time at risk    =  10428.82683
                                                LR chi2(3)       =       61.77
Log likelihood  =   -233.00185                  Prob > chi2      =      0.0000

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   5.862446   4.320108     2.40   0.016     1.382987    24.85076
                   age |    1.12344    .023383     5.59   0.000     1.078532    1.170218
                  male |   1.237463   .4821277     0.55   0.584     .5766284    2.655637
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   5.862446   4.320108     2.40   0.016     1.382987    24.85076
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_000003.tmp saved
(428 observations deleted)
(193 real changes made)
-> stset CSexit_mentalhealth, failure(faildem) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  faildem != 0 & faildem < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,218  total observations
         55  observations end on or before enter()
------------------------------------------------------------------------------
     22,163  observations remaining, representing
         19  failures in single-record/single-failure data
 10,264.444  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  faildem
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22163

  +----------------------------------------------------------------------+
  |                    group    D        Y      Rate     Lower     Upper |
  |----------------------------------------------------------------------|
  |    Hospitalised COVID-19   17   6.0557   2.80725   1.74516   4.51573 |
  | Hospitalised flu 2017_19    2   4.2087   0.47521   0.11885   1.90008 |
  +----------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  faildem
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -184.36951
Iteration 1:   log likelihood = -162.66987
Iteration 2:   log likelihood = -159.09803
Iteration 3:   log likelihood =   -158.846
Iteration 4:   log likelihood = -158.84409
Iteration 5:   log likelihood = -158.84409
Refining estimates:
Iteration 0:   log likelihood = -158.84409

Cox regression -- Breslow method for ties

No. of subjects =       22,163                  Number of obs    =      22,163
No. of failures =           19
Time at risk    =  10264.44353
                                                LR chi2(3)       =       51.05
Log likelihood  =   -158.84409                  Prob > chi2      =      0.0000

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   8.924342    9.18818     2.13   0.034     1.186342    67.13401
                   age |   1.137283   .0296212     4.94   0.000     1.080683    1.196847
                  male |   1.040128   .4834362     0.08   0.933      .418274    2.586502
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   8.924342    9.18818     2.13   0.034     1.186342    67.13401
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_000006.tmp saved
(166 real changes made)
-> stset CSexit_mentalhealth, failure(faildel) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  faildel != 0 & faildel < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
         82  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  faildel
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +--------------------------------------------------------------------+
  |                    group    D        Y     Rate    Lower     Upper |
  |--------------------------------------------------------------------|
  |    Hospitalised COVID-19   58   6.1744   9.3936   7.2621   12.1507 |
  | Hospitalised flu 2017_19   24   4.2544   5.6412   3.7811    8.4163 |
  +--------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  faildel
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -801.73746
Iteration 1:   log likelihood = -743.54122
Iteration 2:   log likelihood = -737.32833
Iteration 3:   log likelihood = -737.11755
Iteration 4:   log likelihood = -737.11723
Refining estimates:
Iteration 0:   log likelihood = -737.11723

Cox regression -- Breslow method for ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =           82
Time at risk    =  10428.82683
                                                LR chi2(3)       =      129.24
Log likelihood  =   -737.11723                  Prob > chi2      =      0.0000

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   1.406705   .3587246     1.34   0.181     .8533709    2.318827
                   age |   1.101724   .0118858     8.98   0.000     1.078673    1.125268
                  male |   .9213443   .2062909    -0.37   0.714      .594068     1.42892
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.406705   .3587246     1.34   0.181     .8533709    2.318827
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_000009.tmp saved
(256 real changes made)
-> stset CSexit_mentalhealth, failure(failsch) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  failsch != 0 & failsch < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
          5  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  failsch
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +------------------------------------------------------------------------+
  |                    group   D        Y       Rate      Lower      Upper |
  |------------------------------------------------------------------------|
  |    Hospitalised COVID-19   2   6.1744   0.323917   0.081011   1.295163 |
  | Hospitalised flu 2017_19   3   4.2544   0.705150   0.227426   2.186367 |
  +------------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  failsch
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -48.953007
Iteration 1:   log likelihood = -48.247053
Iteration 2:   log likelihood = -48.244943
Iteration 3:   log likelihood = -48.244943
Refining estimates:
Iteration 0:   log likelihood = -48.244943

Cox regression -- no ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =            5
Time at risk    =  10428.82683
                                                LR chi2(3)       =        1.42
Log likelihood  =   -48.244943                  Prob > chi2      =      0.7018

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   .3831933   .3547283    -1.04   0.300     .0624377    2.351739
                   age |   1.005439   .0250066     0.22   0.827     .9576024    1.055665
                  male |   .6812177   .6252872    -0.42   0.676     .1127123    4.117187
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3831933   .3547283    -1.04   0.300     .0624377    2.351739
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_00000c.tmp saved
(254 real changes made)
-> stset CSexit_mentalhealth, failure(failmoo) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  failmoo != 0 & failmoo < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
          6  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  failmoo
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +------------------------------------------------------------------------+
  |                    group   D        Y       Rate      Lower      Upper |
  |------------------------------------------------------------------------|
  |    Hospitalised COVID-19   5   6.1744   0.809793   0.337059   1.945553 |
  | Hospitalised flu 2017_19   1   4.2544   0.235050   0.033110   1.668637 |
  +------------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  failmoo
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -59.159672
Iteration 1:   log likelihood =  -58.51502
Iteration 2:   log likelihood = -58.501421
Iteration 3:   log likelihood = -58.501386
Refining estimates:
Iteration 0:   log likelihood = -58.501386

Cox regression -- no ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =            6
Time at risk    =  10428.82683
                                                LR chi2(3)       =        1.32
Log likelihood  =   -58.501386                  Prob > chi2      =      0.7252

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   2.394038   2.635292     0.79   0.428     .2767907    20.70669
                   age |   1.003882   .0242801     0.16   0.873     .9574043    1.052616
                  male |   1.722196   1.497075     0.63   0.532     .3134352    9.462749
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.394038   2.635292     0.79   0.428     .2767907    20.70669
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_00000f.tmp saved
(248 real changes made)
-> stset CSexit_mentalhealth, failure(failneu) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  failneu != 0 & failneu < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
         13  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  failneu
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +----------------------------------------------------------------------+
  |                    group    D        Y      Rate     Lower     Upper |
  |----------------------------------------------------------------------|
  |    Hospitalised COVID-19   11   6.1744   1.78155   0.98662   3.21695 |
  | Hospitalised flu 2017_19    2   4.2544   0.47010   0.11757   1.87967 |
  +----------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  failneu
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -127.91518
Iteration 1:   log likelihood = -122.49281
Iteration 2:   log likelihood =  -122.3719
Iteration 3:   log likelihood = -122.37121
Iteration 4:   log likelihood = -122.37121
Refining estimates:
Iteration 0:   log likelihood = -122.37121

Cox regression -- no ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =           13
Time at risk    =  10428.82683
                                                LR chi2(3)       =       11.09
Log likelihood  =   -122.37121                  Prob > chi2      =      0.0113

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   3.467145   2.678334     1.61   0.108     .7628295    15.75856
                   age |   .9923993   .0150182    -0.50   0.614     .9633965    1.022275
                  male |   .1517763   .1168414    -2.45   0.014     .0335681    .6862483
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   3.467145   2.678334     1.61   0.108     .7628295    15.75856
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_00000i.tmp saved
(178 real changes made)
(137 real changes made)
-> stset CSexit_mentalhealth, failure(failall) enter(time entrydate)
                              origin(time entrydate) scale(365.25)

     failure event:  failall != 0 & failall < .
obs. time interval:  (origin, CSexit_mentalhealth]
 enter on or after:  time entrydate
 exit on or before:  failure
    t for analysis:  (time-origin)/365.25
            origin:  time entrydate

------------------------------------------------------------------------------
     22,646  total observations
         61  observations end on or before enter()
------------------------------------------------------------------------------
     22,585  observations remaining, representing
        107  failures in single-record/single-failure data
 10,428.827  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =  .7282683

         failure _d:  failall
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Estimated failure rates
Number of records  =       22585

  +---------------------------------------------------------------------+
  |                    group    D        Y      Rate    Lower     Upper |
  |---------------------------------------------------------------------|
  |    Hospitalised COVID-19   76   6.1744   12.3089   9.8306   15.4119 |
  | Hospitalised flu 2017_19   31   4.2544    7.2866   5.1244   10.3610 |
  +---------------------------------------------------------------------+
   Notes: Rate = D/Y = failures/person-time (per 1000).
          Lower and Upper are bounds of 95% confidence intervals.


         failure _d:  failall
   analysis time _t:  (CSexit_mentalhealth-origin)/365.25
             origin:  time entrydate
  enter on or after:  time entrydate

Iteration 0:   log likelihood = -1047.6083
Iteration 1:   log likelihood = -1001.9111
Iteration 2:   log likelihood = -999.67116
Iteration 3:   log likelihood = -999.65289
Iteration 4:   log likelihood = -999.65289
Refining estimates:
Iteration 0:   log likelihood = -999.65289

Cox regression -- Breslow method for ties

No. of subjects =       22,585                  Number of obs    =      22,585
No. of failures =          107
Time at risk    =  10428.82683
                                                LR chi2(3)       =       95.91
Log likelihood  =   -999.65289                  Prob > chi2      =      0.0000

----------------------------------------------------------------------------------------
                    _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-----------------------+----------------------------------------------------------------
                 group |
Hospitalised COVID-19  |   1.401048   .3102483     1.52   0.128     .9077424    2.162435
                   age |   1.064961   .0081606     8.21   0.000     1.049086    1.081076
                  male |   .7716809   .1518714    -1.32   0.188     .5247062    1.134904
----------------------------------------------------------------------------------------

 ( 1)  1.group = 0

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.401048   .3102483     1.52   0.128     .9077424    2.162435
------------------------------------------------------------------------------
(1 missing value generated)
(1 missing value generated)
(1 missing value generated)
file E:\STATATMP\ST_86c8_00000l.tmp saved

. clear

. foreach run of any dem demexdem del sch moo neu all{
  2. append using `temp`run''
  3. }
(label grouplab already defined)
(label grouplab already defined)
(label grouplab already defined)
(label grouplab already defined)
(label grouplab already defined)
(label grouplab already defined)

. 
. gen mentalhealthgrouped = "Dementia (F00-F03)" if failtype=="dem"
(12 missing values generated)

. replace mentalhealthgrouped = "(among those with no baseline dementia)" if failtype=="demexdem"
variable mentalhealthgrouped was str18 now str39
(2 real changes made)

. replace mentalhealthgrouped = "Delirium (F05)" if failtype=="del"
(2 real changes made)

. replace mentalhealthgrouped = "Schizophrenia/schizotypal/delusional disorders (F20-29)" if failtype=="sch"
variable mentalhealthgrouped was str39 now str55
(2 real changes made)

. replace mentalhealthgrouped = "Mood disorders (F30-39)" if failtype=="moo"
(2 real changes made)

. replace mentalhealthgrouped = "Neurotic/stress-related/somatoform disorders (F40-48)" if failtype=="neu"
(2 real changes made)

. replace mentalhealthgrouped = "All except dementia (F05-F99)" if failtype=="all"
(2 real changes made)

. 
. gen order = 1 if failtype!=failtype[_n-1]
(7 missing values generated)

. replace order = sum(order)
(13 real changes made)

. gen rateci = string(_Rate, "%4.2f") + " (" + string(_Lower, "%4.2f") + "-" + string(_Upper, "%4.2f") + ")"

. gen _dstr = string(_D) if _D>5
(7 missing values generated)

. replace _dstr = "<=5" if _D<=5
variable _dstr was str2 now str3
(7 real changes made)

. gen events_ratecov = "[" + _dstr + "] " + rateci

. gen hrci = string(hr, "%4.2f") + " (" + string(lci, "%4.2f") + "-" + string(uci, "%4.2f") + ")"

. replace hrci = hrci[_n-1] if group==2
(7 real changes made)

. keep group mentalhealthgrouped events_ratecov hrci order

. reshape wide events_ratecov , i(order) j(group)
(note: j = 1 2)

Data                               long   ->   wide
-----------------------------------------------------------------------------
Number of obs.                       14   ->       7
Number of variables                   5   ->       5
j variable (2 values)             group   ->   (dropped)
xij variables:
                         events_ratecov   ->   events_ratecov1 events_ratecov2
-----------------------------------------------------------------------------

. 
. drop order

. order mentalhealthgrouped

. 
. outsheet using analysis/output/an_posthoc_mentalhealth.txt, replace c 

. 
. log close
      name:  <unnamed>
       log:  e:\analyses\post-admission-admissions-research\analysis/an_posthoc_mentalhealth.log
  log type:  text
 closed on:   1 Apr 2021, 22:01:40
------------------------------------------------------------------------------------------------------------------------------------------------
