-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/analysis/output/cr_getmatches.log
  log type:  text
 opened on:  22 Feb 2021, 09:42:31

. 
. set seed 340590

. 
. frames reset

. use ./analysis/cr_create_analysis_dataset, clear

. 
. count
  70,088

. 
. keep if admitted1_reason=="U071"|admitted1_reason=="U072"
(28,158 observations deleted)

. 
. *drop set if later than 60d before latest sus data
. summ discharged1_date, f d

                      discharged1_date
-------------------------------------------------------------
      Percentiles      Smallest
 1%    23mar2020      11feb2020
 5%    31mar2020      14feb2020
10%    05apr2020      14feb2020       Obs              41,930
25%    17apr2020      14feb2020       Sum of Wgt.      41,930

50%    15jun2020                      Mean          30jul2020
                        Largest       Std. Dev.      105.8639
75%    17nov2020      31dec2020
90%    14dec2020      31dec2020       Variance       11207.16
95%    23dec2020      31dec2020       Skewness       .1490836
99%    30dec2020      31dec2020       Kurtosis       1.224324

. scalar censordate = r(max)

. drop if admitted1_date >= censordate-60 
(12,421 observations deleted)

. 
. *tie together admissions that are within the same day of a previous discharge
. gen coviddischargedate = discharged1_date

. replace coviddischargedate = discharged2_date if discharged1_date==admitted2_
> date
(940 real changes made)

. replace coviddischargedate = discharged3_date if discharged1_date==admitted2_
> date & discharged2_date==admitted3_date
(122 real changes made)

. replace coviddischargedate = discharged4_date if discharged1_date==admitted2_
> date & discharged2_date==admitted3_date & discharged3_date==admitted4_date
(13 real changes made)

. 
. drop if coviddischargedate>=d(1/12/2020)
(170 observations deleted)

. 
. *drop if died date on/before discharge date
. drop if died_date_ons<=coviddischargedate
(8,501 observations deleted)

. 
. keep patient_id stp age male coviddischargedate

. 
. sort coviddischargedate

. 
. gen discharged1_month = month(coviddischargedate)

. 
. *frame put if discharged1_month==2, into(tomatch)
. 
. frame rename default tomatch

. 
. frame create pool 

. frame change pool

. 
. **********PREPARE POOL
. use patient_id stp age male admitted_date discharged_date lastprior* died_dat
> e_ons using ./analysis/cr_create_pool_data_02, clear

. gen byte inpool2=1

. rename age age_p2

. *drop from pool if in hospital on 1st of month 
. drop if lastprioradmission_adm_date<d(1/2/2020) & lastprioradmission_dis_date
>  >= d(1/2/2020) 
(39,648 observations deleted)

. drop lastprior*

. *drop from pool if died on/before 1st of month 
. drop if died_date_ons<=d(1/2/2020) 
(4,839 observations deleted)

. 
. forvalues i = 3/11 {
  2.         
.         if `i'<10 local ifull "0`i'"
  3.         else local ifull "`i'"
  4.         
.         merge 1:1 patient_id using ./analysis/cr_create_pool_data_`ifull' , k
> eepusing(patient_id stp age male admitted_date discharged_date lastprior* die
> d_date_ons)
  5.         rename age age_p`i'
  6. 
.         gen byte inpool`i'=1 if (_merge==2|_merge==3)
  7.         drop _m
  8.         
.         *drop from pool if in hospital on 1st of month 
.         replace inpool`i' = 0 if lastprioradmission_adm_date<d(1/`i'/2020) & 
> lastprioradmission_dis_date >= d(1/`i'/2020) 
  9.         drop lastprior*
 10.         
.         *drop from pool if died on/before 1st of month 
.         replace inpool`i' = 0 if died_date_ons<=d(1/`i'/2020) 
 11.         drop died_date_ons
 12. 
.         sort patient_id
 13. 
. }

    Result                           # of obs.
    -----------------------------------------
    not matched                        70,414
        from master                     5,389  (_merge==1)
        from using                     65,025  (_merge==2)

    matched                        17,446,023  (_merge==3)
    -----------------------------------------
(5,389 missing values generated)
(39,021 real changes made)
(19,892 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        29,930
        from master                    10,060  (_merge==1)
        from using                     19,870  (_merge==2)

    matched                        17,506,377  (_merge==3)
    -----------------------------------------
(10,060 missing values generated)
(23,156 real changes made)
(38,300 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        33,306
        from master                    12,931  (_merge==1)
        from using                     20,375  (_merge==2)

    matched                        17,523,376  (_merge==3)
    -----------------------------------------
(12,931 missing values generated)
(23,345 real changes made)
(64,950 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        35,050
        from master                    15,494  (_merge==1)
        from using                     19,556  (_merge==2)

    matched                        17,541,188  (_merge==3)
    -----------------------------------------
(15,494 missing values generated)
(26,236 real changes made)
(82,829 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        40,007
        from master                    19,099  (_merge==1)
        from using                     20,908  (_merge==2)

    matched                        17,557,139  (_merge==3)
    -----------------------------------------
(19,099 missing values generated)
(29,566 real changes made)
(96,899 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        44,116
        from master                    23,428  (_merge==1)
        from using                     20,688  (_merge==2)

    matched                        17,573,718  (_merge==3)
    -----------------------------------------
(23,428 missing values generated)
(29,401 real changes made)
(110,580 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        48,615
        from master                    27,610  (_merge==1)
        from using                     21,005  (_merge==2)

    matched                        17,590,224  (_merge==3)
    -----------------------------------------
(27,610 missing values generated)
(31,643 real changes made)
(124,514 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        54,450
        from master                    33,376  (_merge==1)
        from using                     21,074  (_merge==2)

    matched                        17,605,463  (_merge==3)
    -----------------------------------------
(33,376 missing values generated)
(32,845 real changes made)
(138,452 real changes made)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                        59,145
        from master                    39,414  (_merge==1)
        from using                     19,731  (_merge==2)

    matched                        17,620,499  (_merge==3)
    -----------------------------------------
(39,414 missing values generated)
(31,384 real changes made)
(154,593 real changes made)

. 
. *remove from pool once hospitalised for covid
. merge 1:1 patient_id using ./analysis/cr_create_analysis_dataset, keepusing(a
> dmitted1_date admitted1_reason)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                    17,609,574
        from master                17,609,565  (_merge==1)
        from using                          9  (_merge==2)

    matched                            70,079  (_merge==3)
    -----------------------------------------

. 
. gen monthfirstineligible = month(admitted1_date)  if (admitted1_reason=="U071
> "|admitted1_reason=="U072") 
(17,637,723 missing values generated)

. replace monthfirstineligible = 1 if monthfirst==13
(0 real changes made)

. 
. forvalues i = 2/11 {
  2.         replace inpool`i'=0 if monthfirstineligible<=`i' 
  3. }
(64 real changes made)
(5,352 real changes made)
(12,726 real changes made)
(12,099 real changes made)
(13,202 real changes made)
(13,591 real changes made)
(14,004 real changes made)
(15,122 real changes made)
(19,648 real changes made)
(24,577 real changes made)

. 
. drop _merge monthfirstineligible

. drop admitted1_date admitted1_reason

. 
. *Make a frame for each stp/sex combo
. forvalues i = 1/32 {
  2.         frame put if stp==`i' & male==0, into(stp`i'_male0)
  3.         frame put if stp==`i' & male==1, into(stp`i'_male1)
  4. }

. 
. frame change tomatch

. frame drop pool 

. 
. for num 1/5: gen long matchedto_X=.

->  gen long matchedto_1=.
(20,838 missing values generated)

->  gen long matchedto_2=.
(20,838 missing values generated)

->  gen long matchedto_3=.
(20,838 missing values generated)

->  gen long matchedto_4=.
(20,838 missing values generated)

->  gen long matchedto_5=.
(20,838 missing values generated)

. 
. qui cou

. local totaltomatch = r(N)

. noi di "Total patients to match = `totaltomatch'" _n
Total patients to match = 20838


. 
. forvalues matchnum = 1/5{
  2. noi di "Getting match number `matchnum's"
  3. 
.         forvalues i = 1/`totaltomatch' {
  4.                 if mod(`i',100)==0 noi di "." _cont
  5.                 if mod(`i',1000)==0 noi di "`i'" _cont
  6. 
.                 scalar idtomatch = patient_id[`i']
  7.                 scalar TMage = age[`i']
  8.                 local TMstp = stp[`i']
  9.                 local TMmale = male[`i']
 10.                 local TMmonth = discharged1_month[`i']
 11.                         
.                 cap frame drop eligiblematches
 12.                 frame change stp`TMstp'_male`TMmale'
 13.                 
.                 frame put if abs(age_p`TMmonth'-TMage)<=3 & inpool`TMmonth'==
> 1, into(eligiblematches)
 14.                 frame eligiblematches: qui cou
 15.                 if r(N)>=1{
 16.                         frame eligiblematches: gen u=uniform()
 17.                         frame eligiblematches: gen agediff=abs(age_p`TMmon
> th'-TMage)
 18.                         frame eligiblematches: sort agediff u
 19.                         frame eligiblematches: scalar selectedmatch = pati
> ent_id[1]
 20.                 }
 21.                 else scalar selectedmatch = -999
 22. 
.                 frame tomatch: qui replace matchedto_`matchnum' = selectedmat
> ch in `i'
 23.                 qui drop if patient_id==selectedmatch
 24.                 
.                 frame change tomatch
 25.         }
 26. }
Getting match number 1s
..........1000..........2000..........3000..........4000..........5000.........
> .6000..........7000..........8000..........9000..........10000..........11000
> ..........12000..........13000..........14000..........15000..........16000..
> ........17000..........18000..........19000..........20000........Getting mat
> ch number 2s
..........1000..........2000..........3000..........4000..........5000.........
> .6000..........7000..........8000..........9000..........10000..........11000
> ..........12000..........13000..........14000..........15000..........16000..
> ........17000..........18000..........19000..........20000........Getting mat
> ch number 3s
..........1000..........2000..........3000..........4000..........5000.........
> .6000..........7000..........8000..........9000..........10000..........11000
> ..........12000..........13000..........14000..........15000..........16000..
> ........17000..........18000..........19000..........20000........Getting mat
> ch number 4s
..........1000..........2000..........3000..........4000..........5000.........
> .6000..........7000..........8000..........9000..........10000..........11000
> ..........12000..........13000..........14000..........15000..........16000..
> ........17000..........18000..........19000..........20000........Getting mat
> ch number 5s
..........1000..........2000..........3000..........4000..........5000.........
> .6000..........7000..........8000..........9000..........10000..........11000
> ..........12000..........13000..........14000..........15000..........16000..
> ........17000..........18000..........19000..........20000........
. 
. frame change tomatch

. keep patient_id matchedto* discharged1_month

. 
. reshape long matchedto_, i(patient_id)
(note: j = 1 2 3 4 5)

Data                               wide   ->   long
-----------------------------------------------------------------------------
Number of obs.                    20838   ->  104190
Number of variables                   7   ->       4
j variable (5 values)                     ->   _j
xij variables:
matchedto_1 matchedto_2 ... matchedto_5   ->   matchedto_
-----------------------------------------------------------------------------

. 
. rename patient_id setid

. rename matchedto patient_id

. 
. expand 2 if setid!=setid[_n-1], gen(expanded)
(20,838 observations created)

. replace patient_id=setid if expanded==1
(20,838 real changes made)

. drop expanded

. 
. replace patient_id = -_n if patient_id==-999
(7 real changes made)

. 
. sort setid patient_id

. safecount if setid!=setid[_n+1] & patient_id<0
  0

. noi di r(N) " patients could not be matched at all"
0 patients could not be matched at all

. drop if patient_id<0
(7 observations deleted)

. 
. gen exposed = patient_id==setid

. 
. *Get correct variables from month-specific pool
. preserve 

.         keep if exposed==1
(104,183 observations deleted)

.         merge m:1 patient_id using "./analysis/cr_create_analysis_dataset.dta
> ", keep(match master)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            20,838  (_merge==3)
    -----------------------------------------

.         
.         *tie together admissions that are within the same day of a previous d
> ischarge (as above pre-matching - this time also produce readmission date)
.         gen coviddischargedate = discharged1_date

.         replace coviddischargedate = discharged2_date if discharged1_date==ad
> mitted2_date
(764 real changes made)

.         replace coviddischargedate = discharged3_date if discharged1_date==ad
> mitted2_date & discharged2_date==admitted3_date
(102 real changes made)

.         replace coviddischargedate = discharged4_date if discharged1_date==ad
> mitted2_date & discharged2_date==admitted3_date & discharged3_date==admitted4
> _date
(11 real changes made)

. 
.         gen readmission_date = admitted2_date 
(12,352 missing values generated)

.         gen readmission_reason = admitted2_reason
(12,822 missing values generated)

.         replace readmission_date = admitted3_date if discharged1_date==admitt
> ed2_date
(764 real changes made, 383 to missing)

.         replace readmission_reason = admitted3_reason if discharged1_date==ad
> mitted2_date
(566 real changes made)

.         replace readmission_date = admitted4_date if discharged1_date==admitt
> ed2_date & discharged2_date==admitted3_date
(102 real changes made, 56 to missing)

.         replace readmission_reason = admitted4_reason if discharged1_date==ad
> mitted2_date & discharged2_date==admitted3_date
(95 real changes made)

.         replace readmission_date = admitted5_date if discharged1_date==admitt
> ed2_date & discharged2_date==admitted3_date & discharged3_date==admitted4_dat
> e
(11 real changes made, 3 to missing)

.         replace readmission_reason = admitted5_reason if discharged1_date==ad
> mitted2_date & discharged2_date==admitted3_date & discharged3_date==admitted4
> _date
(8 real changes made)

.                 
.         tempfile alldata 

.         save `alldata', replace
(note: file /tmp/St00007.000002 not found)
file /tmp/St00007.000002 saved

. restore 

. 
. forvalues i=2/11{
  2.         if `i'<10 local ifull "0`i'"
  3.         else local ifull "`i'"
  4.     preserve
  5.         keep if discharged1_month==`i' & exposed==0
  6.         merge m:1 patient_id using "./analysis/cr_create_pool_data_`ifull'
> .dta", keep(match master)
  7.         append using `alldata'
  8.         save `alldata', replace
  9.         restore
 10. }
(124,981 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                                40  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label smoke already defined)
(label ethnicity already defined)
(label ethnicity_16 already defined)
(label agegroup already defined)
(label bmicat already defined)
(label obese4cat already defined)
(label asthmacat already defined)
(label bpcat already defined)
(label imd already defined)
(label cancer already defined)
(label reduced_kidney_function_cat2lab already defined)
(label diabcat already defined)
file /tmp/St00007.000002 saved
(117,421 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             7,600  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)
file /tmp/St00007.000002 saved
(84,058 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            40,963  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label smoke already defined)
(label ethnicity already defined)
(label ethnicity_16 already defined)
(label agegroup already defined)
(label bmicat already defined)
(label obese4cat already defined)
(label asthmacat already defined)
(label bpcat already defined)
(label imd already defined)
(label cancer already defined)
(label reduced_kidney_function_cat2lab already defined)
(label diabcat already defined)
file /tmp/St00007.000002 saved
(106,926 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            18,095  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)
file /tmp/St00007.000002 saved
(117,796 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             7,225  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label smoke already defined)
(label ethnicity already defined)
(label ethnicity_16 already defined)
(label agegroup already defined)
(label bmicat already defined)
(label obese4cat already defined)
(label asthmacat already defined)
(label bpcat already defined)
(label imd already defined)
(label cancer already defined)
(label reduced_kidney_function_cat2lab already defined)
(label diabcat already defined)
file /tmp/St00007.000002 saved
(121,895 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,126  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)
file /tmp/St00007.000002 saved
(123,366 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             1,655  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label smoke already defined)
(label ethnicity already defined)
(label ethnicity_16 already defined)
(label agegroup already defined)
(label bmicat already defined)
(label obese4cat already defined)
(label asthmacat already defined)
(label bpcat already defined)
(label imd already defined)
(label cancer already defined)
(label reduced_kidney_function_cat2lab already defined)
(label diabcat already defined)
file /tmp/St00007.000002 saved
(121,151 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             3,870  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)
file /tmp/St00007.000002 saved
(110,407 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            14,614  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label smoke already defined)
(label ethnicity already defined)
(label ethnicity_16 already defined)
(label agegroup already defined)
(label bmicat already defined)
(label obese4cat already defined)
(label asthmacat already defined)
(label bpcat already defined)
(label imd already defined)
(label cancer already defined)
(label reduced_kidney_function_cat2lab already defined)
(label diabcat already defined)
file /tmp/St00007.000002 saved
(118,026 observations deleted)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             6,995  (_merge==3)
    -----------------------------------------
(label _merge already defined)
(label diabcat already defined)
(label reduced_kidney_function_cat2lab already defined)
(label cancer already defined)
(label imd already defined)
(label bpcat already defined)
(label asthmacat already defined)
(label obese4cat already defined)
(label bmicat already defined)
(label agegroup already defined)
(label ethnicity_16 already defined)
(label ethnicity already defined)
(label smoke already defined)
file /tmp/St00007.000002 saved

. 
. use `alldata', clear

. gsort setid -exposed patient_id

. save ./analysis/cr_getmatches, replace 
(note: file ./analysis/cr_getmatches.dta not found)
file ./analysis/cr_getmatches.dta saved

. 
. log close
      name:  <unnamed>
       log:  /workspace/analysis/output/cr_getmatches.log
  log type:  text
 closed on:  22 Feb 2021, 15:43:58
-------------------------------------------------------------------------------
